
../apps/bin/hello:     file format elf64-littleriscv

SYMBOL TABLE:
0000000000000000 l    d  .text	0000000000000000 .text
0000000000000e20 l    d  .rodata	0000000000000000 .rodata
0000000000000f24 l    d  .data	0000000000000000 .data
0000000000000000 l    d  .sdata.__dso_handle	0000000000000000 .sdata.__dso_handle
0000000000000008 l    d  .ctors	0000000000000000 .ctors
0000000000000008 l    d  .dtors	0000000000000000 .dtors
0000000000000008 l    d  .bss	0000000000000000 .bss
0000000000000000 l    d  .comment	0000000000000000 .comment
0000000000000000 l    d  .riscv.attributes	0000000000000000 .riscv.attributes
0000000000000000 l    d  .debug_abbrev	0000000000000000 .debug_abbrev
0000000000000000 l    d  .debug_info	0000000000000000 .debug_info
0000000000000000 l    d  .debug_line	0000000000000000 .debug_line
0000000000000000 l    d  .debug_aranges	0000000000000000 .debug_aranges
0000000000000000 l    d  .debug_loc	0000000000000000 .debug_loc
0000000000000000 l    d  .debug_ranges	0000000000000000 .debug_ranges
0000000000000000 l    d  .debug_str	0000000000000000 .debug_str
0000000000000000 l    d  .debug_frame	0000000000000000 .debug_frame
0000000000000000 l    df *ABS*	0000000000000000 crt0.c
0000000000000000 l     F .text	000000000000001a sig_trampoline
0000000000000024 l       .text	0000000000000000 .L0 
0000000000000000 l       .debug_abbrev	0000000000000000 .Ldebug_abbrev0
0000000000000092 l       .debug_str	0000000000000000 .LASF32

    DW_AT value: 0     DW_FORM value: 0
   16      DW_TAG_formal_parameter    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_type         DW_FORM_ref4
    DW_AT value: 0     DW_FORM value: 0
   17      DW_TAG_variable    [no children]
    DW_AT_name         DW_FORM_string
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_type         DW_FORM_ref4
    DW_AT value: 0     DW_FORM value: 0

Contents of the .debug_info section (loaded from ../apps/bin/hello):

  Compilation Unit @ offset 0x0:
   Length:        0x26a (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x92): GNU C17 10.2.0 -mcmodel=medany -march=rv64imafdc -mabi=lp64d -march=rv64imafdc -g -Os -fno-common -fno-strict-aliasing -fomit-frame-pointer -ffunction-sections -fdata-sections
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xe): common/crt0.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x242): /Users/Luppy/ox64/nuttx/arch/risc-v/src
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <25>   DW_AT_stmt_list   : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x21b): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x239): _uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 52
    <37>   DW_AT_decl_column : 28
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x142): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x158): short int
 <1><4a>: Abbrev Number: 2 (DW_TAG_base_type)
    <4b>   DW_AT_byte_size   : 2
    <4c>   DW_AT_encoding    : 7	(unsigned)
    <4d>   DW_AT_name        : (indirect string, offset: 0x76): short unsigned int
 <1><51>: Abbrev Number: 4 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 4
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : int
 <1><58>: Abbrev Number: 2 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 4
    <5a>   DW_AT_encoding    : 7	(unsigned)
    <5b>   DW_AT_name        : (indirect string, offset: 0x184): unsigned int
 <1><5f>: Abbrev Number: 2 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 8
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x1ff): long int
 <1><66>: Abbrev Number: 2 (DW_TAG_base_type)
    <67>   DW_AT_byte_size   : 8
    <68>   DW_AT_encoding    : 7	(unsigned)
    <69>   DW_AT_name        : (indirect string, offset: 0x64): long unsigned int
 <1><6d>: Abbrev Number: 2 (DW_TAG_base_type)
    <6e>   DW_AT_byte_size   : 8
    <6f>   DW_AT_encoding    : 7	(unsigned)
    <70>   DW_AT_name        : (indirect string, offset: 0x191): long long unsigned int
 <1><74>: Abbrev Number: 3 (DW_TAG_typedef)
    <75>   DW_AT_name        : (indirect string, offset: 0x1a8): uint8_t
    <79>   DW_AT_decl_file   : 3
    <7a>   DW_AT_decl_line   : 166
    <7b>   DW_AT_decl_column : 29
    <7c>   DW_AT_type        : <0x30>
 <1><80>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <81>   DW_AT_byte_size   : 8
 <1><82>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <83>   DW_AT_byte_size   : 8
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 1
    <8a>   DW_AT_encoding    : 8	(unsigned char)
    <8b>   DW_AT_name        : (indirect string, offset: 0x9): char
 <1><8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <90>   DW_AT_byte_size   : 8
    <91>   DW_AT_type        : <0x82>
 <1><95>: Abbrev Number: 2 (DW_TAG_base_type)
    <96>   DW_AT_byte_size   : 8
    <97>   DW_AT_encoding    : 5	(signed)
    <98>   DW_AT_name        : (indirect string, offset: 0x1c5): long long int
 <1><9c>: Abbrev Number: 2 (DW_TAG_base_type)
    <9d>   DW_AT_byte_size   : 16
    <9e>   DW_AT_encoding    : 4	(float)
    <9f>   DW_AT_name        : (indirect string, offset: 0x20f): long double
 <1><a3>: Abbrev Number: 7 (DW_TAG_union_type)
    <a4>   DW_AT_name        : (indirect string, offset: 0x208): sigval
    <a8>   DW_AT_byte_size   : 8
    <a9>   DW_AT_decl_file   : 4
    <aa>   DW_AT_decl_line   : 325
    <ac>   DW_AT_decl_column : 7
    <ad>   DW_AT_sibling     : <0xcc>
 <2><b1>: Abbrev Number: 8 (DW_TAG_member)
    <b2>   DW_AT_name        : (indirect string, offset: 0x5a): sival_int
    <b6>   DW_AT_decl_file   : 4
    <b7>   DW_AT_decl_line   : 327
    <b9>   DW_AT_decl_column : 13
    <ba>   DW_AT_type        : <0x51>
 <2><be>: Abbrev Number: 8 (DW_TAG_member)
    <bf>   DW_AT_name        : (indirect string, offset: 0x1c): sival_ptr
    <c3>   DW_AT_decl_file   : 4
    <c4>   DW_AT_decl_line   : 328
    <c6>   DW_AT_decl_column : 13
    <c7>   DW_AT_type        : <0x80>
 <2><cb>: Abbrev Number: 0
 <1><cc>: Abbrev Number: 9 (DW_TAG_structure_type)
    <cd>   DW_AT_name        : (indirect string, offset: 0x1d3): siginfo
    <d1>   DW_AT_byte_size   : 24
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 352
    <d5>   DW_AT_decl_column : 8
    <d6>   DW_AT_sibling     : <0x121>
 <2><da>: Abbrev Number: 10 (DW_TAG_member)
    <db>   DW_AT_name        : (indirect string, offset: 0x0): si_signo
    <df>   DW_AT_decl_file   : 4
    <e0>   DW_AT_decl_line   : 354
    <e2>   DW_AT_decl_column : 16
    <e3>   DW_AT_type        : <0x74>
    <e7>   DW_AT_data_member_location: 0
 <2><e8>: Abbrev Number: 10 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x150): si_code
    <ed>   DW_AT_decl_file   : 4
    <ee>   DW_AT_decl_line   : 355
    <f0>   DW_AT_decl_column : 16
    <f1>   DW_AT_type        : <0x74>
    <f5>   DW_AT_data_member_location: 1
 <2><f6>: Abbrev Number: 10 (DW_TAG_member)
    <f7>   DW_AT_name        : (indirect string, offset: 0x51): si_errno
    <fb>   DW_AT_decl_file   : 4
    <fc>   DW_AT_decl_line   : 356
    <fe>   DW_AT_decl_column : 16
    <ff>   DW_AT_type        : <0x74>
    <103>   DW_AT_data_member_location: 2
 <2><104>: Abbrev Number: 10 (DW_TAG_member)
    <105>   DW_AT_name        : (indirect string, offset: 0x89): si_value
    <109>   DW_AT_decl_file   : 4
    <10a>   DW_AT_decl_line   : 357
    <10c>   DW_AT_decl_column : 16
    <10d>   DW_AT_type        : <0xa3>
    <111>   DW_AT_data_member_location: 8
 <2><112>: Abbrev Number: 10 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x17c): si_user
    <117>   DW_AT_decl_file   : 4
    <118>   DW_AT_decl_line   : 365
    <11a>   DW_AT_decl_column : 16
    <11b>   DW_AT_type        : <0x80>
    <11f>   DW_AT_data_member_location: 16
 <2><120>: Abbrev Number: 0
 <1><121>: Abbrev Number: 11 (DW_TAG_typedef)
    <122>   DW_AT_name        : (indirect string, offset: 0x1eb): siginfo_t
    <126>   DW_AT_decl_file   : 4
    <127>   DW_AT_decl_line   : 368
    <129>   DW_AT_decl_column : 24
    <12a>   DW_AT_type        : <0xcc>
 <1><12e>: Abbrev Number: 11 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x1db): _sa_sigaction_t
    <133>   DW_AT_decl_file   : 4
    <134>   DW_AT_decl_line   : 375
    <136>   DW_AT_decl_column : 21
    <137>   DW_AT_type        : <0x13b>
 <1><13b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <13c>   DW_AT_byte_size   : 8
    <13d>   DW_AT_type        : <0x141>
 <1><141>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <142>   DW_AT_prototyped  : 1
    <142>   DW_AT_sibling     : <0x156>
 <2><146>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <147>   DW_AT_type        : <0x51>
 <2><14b>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <14c>   DW_AT_type        : <0x156>
 <2><150>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <151>   DW_AT_type        : <0x80>
 <2><155>: Abbrev Number: 0
 <1><156>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <157>   DW_AT_byte_size   : 8
    <158>   DW_AT_type        : <0x121>
 <1><15c>: Abbrev Number: 2 (DW_TAG_base_type)
    <15d>   DW_AT_byte_size   : 1
    <15e>   DW_AT_encoding    : 2	(boolean)
    <15f>   DW_AT_name        : (indirect string, offset: 0x227): _Bool
 <1><163>: Abbrev Number: 11 (DW_TAG_typedef)
    <164>   DW_AT_name        : (indirect string, offset: 0x162): addrenv_sigtramp_t
    <168>   DW_AT_decl_file   : 5
    <169>   DW_AT_decl_line   : 281
    <16b>   DW_AT_decl_column : 21
    <16c>   DW_AT_type        : <0x170>
 <1><170>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <171>   DW_AT_byte_size   : 8
    <172>   DW_AT_type        : <0x176>
 <1><176>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <177>   DW_AT_prototyped  : 1
    <177>   DW_AT_sibling     : <0x190>
 <2><17b>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <17c>   DW_AT_type        : <0x12e>
 <2><180>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <181>   DW_AT_type        : <0x51>
 <2><185>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <186>   DW_AT_type        : <0x156>
 <2><18a>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <18b>   DW_AT_type        : <0x80>
 <2><18f>: Abbrev Number: 0
 <1><190>: Abbrev Number: 9 (DW_TAG_structure_type)
    <191>   DW_AT_name        : (indirect string, offset: 0x35): addrenv_reserve_s
    <195>   DW_AT_byte_size   : 16
    <196>   DW_AT_decl_file   : 5
    <197>   DW_AT_decl_line   : 289
    <199>   DW_AT_decl_column : 8
    <19a>   DW_AT_sibling     : <0x1bb>
 <2><19e>: Abbrev Number: 10 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0x22d): ar_sigtramp
    <1a3>   DW_AT_decl_file   : 5
    <1a4>   DW_AT_decl_line   : 291
    <1a6>   DW_AT_decl_column : 22
    <1a7>   DW_AT_type        : <0x163>
    <1ab>   DW_AT_data_member_location: 0
 <2><1ac>: Abbrev Number: 10 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x1ba): ar_usrheap
    <1b1>   DW_AT_decl_file   : 5
    <1b2>   DW_AT_decl_line   : 292
    <1b4>   DW_AT_decl_column : 22
    <1b5>   DW_AT_type        : <0x1c0>
    <1b9>   DW_AT_data_member_location: 8
 <2><1ba>: Abbrev Number: 0
 <1><1bb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x47): mm_heap_s
    <1c0>   DW_AT_declaration : 1
 <1><1c0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1c1>   DW_AT_byte_size   : 8
    <1c2>   DW_AT_type        : <0x1bb>
 <1><1c6>: Abbrev Number: 15 (DW_TAG_subprogram)
    <1c7>   DW_AT_external    : 1
    <1c7>   DW_AT_name        : (indirect string, offset: 0x175): _start
    <1cb>   DW_AT_decl_file   : 1
    <1cc>   DW_AT_decl_line   : 165
    <1cd>   DW_AT_decl_column : 6
    <1ce>   DW_AT_prototyped  : 1
    <1ce>   DW_AT_low_pc      : 0x1a
    <1d6>   DW_AT_high_pc     : 0x24
    <1de>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1e0>   DW_AT_GNU_all_call_sites: 1
    <1e0>   DW_AT_sibling     : <0x23b>
 <2><1e4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x1b5): argc
    <1e9>   DW_AT_decl_file   : 1
    <1ea>   DW_AT_decl_line   : 165
    <1eb>   DW_AT_decl_column : 17
    <1ec>   DW_AT_type        : <0x51>
    <1f0>   DW_AT_location    : 0x0 (location list)
 <2><1f4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x1fa): argv
    <1f9>   DW_AT_decl_file   : 1
    <1fa>   DW_AT_decl_line   : 165
    <1fb>   DW_AT_decl_column : 29
    <1fc>   DW_AT_type        : <0x8f>
    <200>   DW_AT_location    : 0x39 (location list)
 <2><204>: Abbrev Number: 17 (DW_TAG_variable)
    <205>   DW_AT_name        : ret
    <209>   DW_AT_decl_file   : 1
    <20a>   DW_AT_decl_line   : 167
    <20b>   DW_AT_decl_column : 7
    <20c>   DW_AT_type        : <0x51>
    <210>   DW_AT_location    : 0x72 (location list)
 <2><214>: Abbrev Number: 18 (DW_TAG_GNU_call_site)
    <215>   DW_AT_low_pc      : 0x36
    <21d>   DW_AT_abstract_origin: <0x255>
    <221>   DW_AT_sibling     : <0x22d>
 <3><225>: Abbrev Number: 19 (DW_TAG_GNU_call_site_parameter)
    <226>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <228>   DW_AT_GNU_call_site_value: 3 byte block: f3 1 5b 	(DW_OP_GNU_entry_value: (DW_OP_reg11 (a1)))
 <3><22c>: Abbrev Number: 0
 <2><22d>: Abbrev Number: 20 (DW_TAG_GNU_call_site)
    <22e>   DW_AT_low_pc      : 0x3e
    <236>   DW_AT_abstract_origin: <0x261>
 <2><23a>: Abbrev Number: 0
 <1><23b>: Abbrev Number: 21 (DW_TAG_subprogram)
    <23c>   DW_AT_name        : (indirect string, offset: 0x26): sig_trampoline
    <240>   DW_AT_decl_file   : 1
    <241>   DW_AT_decl_line   : 68
    <242>   DW_AT_decl_column : 13
    <243>   DW_AT_prototyped  : 1
    <243>   DW_AT_low_pc      : 0x0
    <24b>   DW_AT_high_pc     : 0x1a
    <253>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <255>   DW_AT_GNU_all_call_sites: 1
 <1><255>: Abbrev Number: 22 (DW_TAG_subprogram)
    <256>   DW_AT_external    : 1
    <256>   DW_AT_declaration : 1
    <256>   DW_AT_linkage_name: (indirect string, offset: 0x1b0): main
    <25a>   DW_AT_name        : (indirect string, offset: 0x1b0): main
    <25e>   DW_AT_decl_file   : 1
    <25f>   DW_AT_decl_line   : 42
    <260>   DW_AT_decl_column : 5
 <1><261>: Abbrev Number: 22 (DW_TAG_subprogram)
    <262>   DW_AT_external    : 1
    <262>   DW_AT_declaration : 1
    <262>   DW_AT_linkage_name: (indirect string, offset: 0x1f5): exit
    <266>   DW_AT_name        : (indirect string, offset: 0x1f5): exit
    <26a>   DW_AT_decl_file   : 6
    <26b>   DW_AT_decl_line   : 169
    <26c>   DW_AT_decl_column : 11
 <1><26d>: Abbrev Number: 0
  Compilation Unit @ offset 0x26e:
   Length:        0xf6 (32-bit)
   Version:       4
   Abbrev Offset: 0x140
   Pointer Size:  8
 <0><279>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <27a>   DW_AT_producer    : (indirect string, offset: 0x35b): GNU C17 10.2.0 -mcmodel=medany -march=rv64imafdc -mabi=lp64d -march=rv64imafdc -g -Os -fno-common -fno-strict-aliasing -fomit-frame-pointer -ffunction-sections -fdata-sections
    <27e>   DW_AT_language    : 12	(ANSI C99)
    <27f>   DW_AT_name        : (indirect string, offset: 0x300): hello_main.c
    <283>   DW_AT_comp_dir    : (indirect string, offset: 0x2d5): /Users/Luppy/ox64/apps/examples/hello
    <287>   DW_AT_ranges      : 0x30
    <28b>   DW_AT_low_pc      : 0x0
    <293>   DW_AT_stmt_list   : 0x15e
 <1><297>: Abbrev Number: 2 (DW_TAG_base_type)
    <298>   DW_AT_byte_size   : 1
    <299>   DW_AT_encoding    : 6	(signed char)
    <29a>   DW_AT_name        : (indirect string, offset: 0x334): signed char
 <1><29e>: Abbrev Number: 2 (DW_TAG_base_type)
    <29f>   DW_AT_byte_size   : 1
    <2a0>   DW_AT_encoding    : 8	(unsigned char)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x2c7): unsigned char
 <1><2a5>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a6>   DW_AT_byte_size   : 2
    <2a7>   DW_AT_encoding    : 5	(signed)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x351): short int
 <1><2ac>: Abbrev Number: 2 (DW_TAG_base_type)
    <2ad>   DW_AT_byte_size   : 2
    <2ae>   DW_AT_encoding    : 7	(unsigned)
    <2af>   DW_AT_name        : (indirect string, offset: 0x321): short unsigned int
 <1><2b3>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b4>   DW_AT_byte_size   : 4
    <2b5>   DW_AT_encoding    : 5	(signed)
    <2b6>   DW_AT_name        : int
 <1><2ba>: Abbrev Number: 2 (DW_TAG_base_type)
    <2bb>   DW_AT_byte_size   : 4
    <2bc>   DW_AT_encoding    : 7	(unsigned)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x278): unsigned int
 <1><2c1>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c2>   DW_AT_byte_size   : 8
    <2c3>   DW_AT_encoding    : 5	(signed)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x313): long int
 <1><2c8>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c9>   DW_AT_byte_size   : 8
    <2ca>   DW_AT_encoding    : 7	(unsigned)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x29e): long unsigned int
 <1><2cf>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d0>   DW_AT_byte_size   : 8
    <2d1>   DW_AT_encoding    : 7	(unsigned)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x2b0): long long unsigned int
 <1><2d6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <2d7>   DW_AT_byte_size   : 8
    <2d8>   DW_AT_type        : <0x2dc>
 <1><2dc>: Abbrev Number: 2 (DW_TAG_base_type)
    <2dd>   DW_AT_byte_size   : 1
    <2de>   DW_AT_encoding    : 8	(unsigned char)
    <2df>   DW_AT_name        : (indirect string, offset: 0x2fb): char
 <1><2e3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <2e4>   DW_AT_byte_size   : 8
    <2e5>   DW_AT_type        : <0x2d6>
 <1><2e9>: Abbrev Number: 2 (DW_TAG_base_type)
    <2ea>   DW_AT_byte_size   : 8
    <2eb>   DW_AT_encoding    : 5	(signed)
    <2ec>   DW_AT_name        : (indirect string, offset: 0x26a): long long int
 <1><2f0>: Abbrev Number: 2 (DW_TAG_base_type)
    <2f1>   DW_AT_byte_size   : 16
    <2f2>   DW_AT_encoding    : 4	(float)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x345): long double
 <1><2f7>: Abbrev Number: 2 (DW_TAG_base_type)
    <2f8>   DW_AT_byte_size   : 1
    <2f9>   DW_AT_encoding    : 2	(boolean)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x30d): _Bool
 <1><2fe>: Abbrev Number: 5 (DW_TAG_subprogram)
    <2ff>   DW_AT_external    : 1
    <2ff>   DW_AT_name        : (indirect string, offset: 0x28a): main
    <303>   DW_AT_decl_file   : 1
    <304>   DW_AT_decl_line   : 36
    <305>   DW_AT_decl_column : 5
    <306>   DW_AT_prototyped  : 1
    <306>   DW_AT_type        : <0x2b3>
    <30a>   DW_AT_low_pc      : 0x3e
    <312>   DW_AT_high_pc     : 0x1c
    <31a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <31c>   DW_AT_GNU_all_call_sites: 1
    <31c>   DW_AT_sibling     : <0x35c>
 <2><320>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <321>   DW_AT_name        : (indirect string, offset: 0x31c): argc
    <325>   DW_AT_decl_file   : 1
    <326>   DW_AT_decl_line   : 36
    <327>   DW_AT_decl_column : 14
    <328>   DW_AT_type        : <0x2b3>
    <32c>   DW_AT_location    : 0x95 (location list)
 <2><330>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <331>   DW_AT_name        : (indirect string, offset: 0x340): argv
    <335>   DW_AT_decl_file   : 1
    <336>   DW_AT_decl_line   : 36
    <337>   DW_AT_decl_column : 30
    <338>   DW_AT_type        : <0x2e3>
    <33c>   DW_AT_location    : 0xce (location list)
 <2><340>: Abbrev Number: 7 (DW_TAG_GNU_call_site)
    <341>   DW_AT_low_pc      : 0x52
    <349>   DW_AT_abstract_origin: <0x35c>
 <3><34d>: Abbrev Number: 8 (DW_TAG_GNU_call_site_parameter)
    <34e>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <350>   DW_AT_GNU_call_site_value: 9 byte block: 3 20 e 0 0 0 0 0 0 	(DW_OP_addr: e20)
 <3><35a>: Abbrev Number: 0
 <2><35b>: Abbrev Number: 0
 <1><35c>: Abbrev Number: 9 (DW_TAG_subprogram)
    <35d>   DW_AT_external    : 1
    <35d>   DW_AT_declaration : 1
    <35d>   DW_AT_linkage_name: (indirect string, offset: 0x285): puts
    <361>   DW_AT_name        : (indirect string, offset: 0x28f): __builtin_puts
    <365>   DW_AT_decl_file   : 2
    <366>   DW_AT_decl_line   : 0
 <1><367>: Abbrev Number: 0
  Compilation Unit @ offset 0x368:
   Length:        0x5e9 (32-bit)
   Version:       4
   Abbrev Offset: 0x1ca
   Pointer Size:  8
 <0><373>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <374>   DW_AT_producer    : (indirect string, offset: 0x4b2): GNU C17 10.2.0 -mcmodel=medany -march=rv64imafdc -mabi=lp64d -march=rv64imafdc -g -Os -fno-common -fno-strict-aliasing -fomit-frame-pointer -ffunction-sections -fdata-sections
    <378>   DW_AT_language    : 12	(ANSI C99)
    <379>   DW_AT_name        : (indirect string, offset: 0x78f): stdio/lib_puts.c
    <37d>   DW_AT_comp_dir    : (indirect string, offset: 0x5c8): /Users/Luppy/ox64/nuttx/libs/libc
    <381>   DW_AT_ranges      : 0x50
    <385>   DW_AT_low_pc      : 0x0
    <38d>   DW_AT_stmt_list   : 0x1e8
 <1><391>: Abbrev Number: 2 (DW_TAG_base_type)
    <392>   DW_AT_byte_size   : 1
    <393>   DW_AT_encoding    : 6	(signed char)
    <394>   DW_AT_name        : (indirect string, offset: 0x695): signed char
 <1><398>: Abbrev Number: 3 (DW_TAG_typedef)
    <399>   DW_AT_name        : (indirect string, offset: 0x432): _uint8_t
    <39d>   DW_AT_decl_file   : 2
    <39e>   DW_AT_decl_line   : 52
    <39f>   DW_AT_decl_column : 28
    <3a0>   DW_AT_type        : <0x3a4>
 <1><3a4>: Abbrev Number: 2 (DW_TAG_base_type)
    <3a5>   DW_AT_byte_size   : 1
    <3a6>   DW_AT_encoding    : 8	(unsigned char)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x661): unsigned char
 <1><3ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x66f): _int16_t
    <3b0>   DW_AT_decl_file   : 2
    <3b1>   DW_AT_decl_line   : 54
    <3b2>   DW_AT_decl_column : 28
    <3b3>   DW_AT_type        : <0x3b7>
 <1><3b7>: Abbrev Number: 2 (DW_TAG_base_type)
    <3b8>   DW_AT_byte_size   : 2
    <3b9>   DW_AT_encoding    : 5	(signed)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x4a8): short int
 <1><3be>: Abbrev Number: 3 (DW_TAG_typedef)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x7d5): _uint16_t
    <3c3>   DW_AT_decl_file   : 2
    <3c4>   DW_AT_decl_line   : 55
    <3c5>   DW_AT_decl_column : 28
    <3c6>   DW_AT_type        : <0x3ca>
 <1><3ca>: Abbrev Number: 2 (DW_TAG_base_type)
    <3cb>   DW_AT_byte_size   : 2
    <3cc>   DW_AT_encoding    : 7	(unsigned)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x6f3): short unsigned int
 <1><3d1>: Abbrev Number: 3 (DW_TAG_typedef)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x64e): _int32_t
    <3d6>   DW_AT_decl_file   : 2
    <3d7>   DW_AT_decl_line   : 58
    <3d8>   DW_AT_decl_column : 28
    <3d9>   DW_AT_type        : <0x3dd>
 <1><3dd>: Abbrev Number: 4 (DW_TAG_base_type)
    <3de>   DW_AT_byte_size   : 4
    <3df>   DW_AT_encoding    : 5	(signed)
    <3e0>   DW_AT_name        : int
 <1><3e4>: Abbrev Number: 2 (DW_TAG_base_type)
    <3e5>   DW_AT_byte_size   : 4
    <3e6>   DW_AT_encoding    : 7	(unsigned)
    <3e7>   DW_AT_name        : (indirect string, offset: 0x7ec): unsigned int
 <1><3eb>: Abbrev Number: 2 (DW_TAG_base_type)
    <3ec>   DW_AT_byte_size   : 8
    <3ed>   DW_AT_encoding    : 5	(signed)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x713): long int
 <1><3f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f3>   DW_AT_byte_size   : 8
    <3f4>   DW_AT_encoding    : 7	(unsigned)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x6cc): long unsigned int
 <1><3f9>: Abbrev Number: 3 (DW_TAG_typedef)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x82b): _ssize_t
    <3fe>   DW_AT_decl_file   : 2
    <3ff>   DW_AT_decl_line   : 91
    <400>   DW_AT_decl_column : 28
    <401>   DW_AT_type        : <0x3eb>
 <1><405>: Abbrev Number: 3 (DW_TAG_typedef)
    <406>   DW_AT_name        : (indirect string, offset: 0x477): _size_t
    <40a>   DW_AT_decl_file   : 2
    <40b>   DW_AT_decl_line   : 93
    <40c>   DW_AT_decl_column : 28
    <40d>   DW_AT_type        : <0x3f2>
 <1><411>: Abbrev Number: 2 (DW_TAG_base_type)
    <412>   DW_AT_byte_size   : 8
    <413>   DW_AT_encoding    : 7	(unsigned)
    <414>   DW_AT_name        : (indirect string, offset: 0x6a7): long long unsigned int
 <1><418>: Abbrev Number: 3 (DW_TAG_typedef)
    <419>   DW_AT_name        : (indirect string, offset: 0x571): uint8_t
    <41d>   DW_AT_decl_file   : 3
    <41e>   DW_AT_decl_line   : 166
    <41f>   DW_AT_decl_column : 29
    <420>   DW_AT_type        : <0x398>
 <1><424>: Abbrev Number: 3 (DW_TAG_typedef)
    <425>   DW_AT_name        : (indirect string, offset: 0x724): int16_t
    <429>   DW_AT_decl_file   : 3
    <42a>   DW_AT_decl_line   : 168
    <42b>   DW_AT_decl_column : 29
    <42c>   DW_AT_type        : <0x3ab>
 <1><430>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <431>   DW_AT_type        : <0x424>
 <1><435>: Abbrev Number: 3 (DW_TAG_typedef)
    <436>   DW_AT_name        : (indirect string, offset: 0x6c3): uint16_t
    <43a>   DW_AT_decl_file   : 3
    <43b>   DW_AT_decl_line   : 169
    <43c>   DW_AT_decl_column : 29
    <43d>   DW_AT_type        : <0x3be>
 <1><441>: Abbrev Number: 3 (DW_TAG_typedef)
    <442>   DW_AT_name        : (indirect string, offset: 0x71c): int32_t
    <446>   DW_AT_decl_file   : 3
    <447>   DW_AT_decl_line   : 176
    <448>   DW_AT_decl_column : 29
    <449>   DW_AT_type        : <0x3d1>
 <1><44d>: Abbrev Number: 3 (DW_TAG_typedef)
    <44e>   DW_AT_name        : (indirect string, offset: 0x44f): size_t
    <452>   DW_AT_decl_file   : 4
    <453>   DW_AT_decl_line   : 133
    <454>   DW_AT_decl_column : 22
    <455>   DW_AT_type        : <0x405>
 <1><459>: Abbrev Number: 3 (DW_TAG_typedef)
    <45a>   DW_AT_name        : (indirect string, offset: 0x4a0): ssize_t
    <45e>   DW_AT_decl_file   : 4
    <45f>   DW_AT_decl_line   : 134
    <460>   DW_AT_decl_column : 22
    <461>   DW_AT_type        : <0x3f9>
 <1><465>: Abbrev Number: 3 (DW_TAG_typedef)
    <466>   DW_AT_name        : (indirect string, offset: 0x789): pid_t
    <46a>   DW_AT_decl_file   : 4
    <46b>   DW_AT_decl_line   : 162
    <46c>   DW_AT_decl_column : 22
    <46d>   DW_AT_type        : <0x3dd>
 <1><471>: Abbrev Number: 3 (DW_TAG_typedef)
    <472>   DW_AT_name        : (indirect string, offset: 0x62b): off_t
    <476>   DW_AT_decl_file   : 4
    <477>   DW_AT_decl_line   : 229
    <478>   DW_AT_decl_column : 22
    <479>   DW_AT_type        : <0x441>
 <1><47d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <47e>   DW_AT_byte_size   : 8
 <1><47f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <480>   DW_AT_byte_size   : 8
    <481>   DW_AT_type        : <0x485>
 <1><485>: Abbrev Number: 2 (DW_TAG_base_type)
    <486>   DW_AT_byte_size   : 1
    <487>   DW_AT_encoding    : 8	(unsigned char)
    <488>   DW_AT_name        : (indirect string, offset: 0x706): char
 <1><48c>: Abbrev Number: 8 (DW_TAG_const_type)
    <48d>   DW_AT_type        : <0x485>
 <1><491>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <492>   DW_AT_byte_size   : 8
    <493>   DW_AT_type        : <0x48c>
 <1><497>: Abbrev Number: 9 (DW_TAG_structure_type)
    <498>   DW_AT_name        : (indirect string, offset: 0x637): dq_entry_s
    <49c>   DW_AT_byte_size   : 16
    <49d>   DW_AT_decl_file   : 5
    <49e>   DW_AT_decl_line   : 303
    <4a0>   DW_AT_decl_column : 8
    <4a1>   DW_AT_sibling     : <0x4c2>
 <2><4a5>: Abbrev Number: 10 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x631): flink
    <4aa>   DW_AT_decl_file   : 5
    <4ab>   DW_AT_decl_line   : 305
    <4ad>   DW_AT_decl_column : 26
    <4ae>   DW_AT_type        : <0x4c2>
    <4b2>   DW_AT_data_member_location: 0
 <2><4b3>: Abbrev Number: 10 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x411): blink
    <4b8>   DW_AT_decl_file   : 5
    <4b9>   DW_AT_decl_line   : 306
    <4bb>   DW_AT_decl_column : 26
    <4bc>   DW_AT_type        : <0x4c2>
    <4c0>   DW_AT_data_member_location: 8
 <2><4c1>: Abbrev Number: 0
 <1><4c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4c3>   DW_AT_byte_size   : 8
    <4c4>   DW_AT_type        : <0x497>
 <1><4c8>: Abbrev Number: 11 (DW_TAG_typedef)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x73a): dq_entry_t
    <4cd>   DW_AT_decl_file   : 5
    <4ce>   DW_AT_decl_line   : 308
    <4d0>   DW_AT_decl_column : 27
    <4d1>   DW_AT_type        : <0x497>
 <1><4d5>: Abbrev Number: 9 (DW_TAG_structure_type)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x80e): dq_queue_s
    <4da>   DW_AT_byte_size   : 16
    <4db>   DW_AT_decl_file   : 5
    <4dc>   DW_AT_decl_line   : 317
    <4de>   DW_AT_decl_column : 8
    <4df>   DW_AT_sibling     : <0x500>
 <2><4e3>: Abbrev Number: 10 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x56c): head
    <4e8>   DW_AT_decl_file   : 5
    <4e9>   DW_AT_decl_line   : 319
    <4eb>   DW_AT_decl_column : 19
    <4ec>   DW_AT_type        : <0x500>
    <4f0>   DW_AT_data_member_location: 0
 <2><4f1>: Abbrev Number: 10 (DW_TAG_member)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x6be): tail
    <4f6>   DW_AT_decl_file   : 5
    <4f7>   DW_AT_decl_line   : 320
    <4f9>   DW_AT_decl_column : 19
    <4fa>   DW_AT_type        : <0x500>
    <4fe>   DW_AT_data_member_location: 8
 <2><4ff>: Abbrev Number: 0
 <1><500>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <501>   DW_AT_byte_size   : 8
    <502>   DW_AT_type        : <0x4c8>
 <1><506>: Abbrev Number: 11 (DW_TAG_typedef)
    <507>   DW_AT_name        : (indirect string, offset: 0x7c5): dq_queue_t
    <50b>   DW_AT_decl_file   : 5
    <50c>   DW_AT_decl_line   : 322
    <50e>   DW_AT_decl_column : 27
    <50f>   DW_AT_type        : <0x4d5>
 <1><513>: Abbrev Number: 12 (DW_TAG_structure_type)
    <514>   DW_AT_name        : (indirect string, offset: 0x58f): sem_s
    <518>   DW_AT_byte_size   : 24
    <519>   DW_AT_decl_file   : 6
    <51a>   DW_AT_decl_line   : 99
    <51b>   DW_AT_decl_column : 8
    <51c>   DW_AT_sibling     : <0x548>
 <2><520>: Abbrev Number: 13 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x678): semcount
    <525>   DW_AT_decl_file   : 6
    <526>   DW_AT_decl_line   : 101
    <527>   DW_AT_decl_column : 20
    <528>   DW_AT_type        : <0x430>
    <52c>   DW_AT_data_member_location: 0
 <2><52d>: Abbrev Number: 13 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0x6a1): flags
    <532>   DW_AT_decl_file   : 6
    <533>   DW_AT_decl_line   : 108
    <534>   DW_AT_decl_column : 11
    <535>   DW_AT_type        : <0x418>
    <539>   DW_AT_data_member_location: 2
 <2><53a>: Abbrev Number: 13 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0x47f): waitlist
    <53f>   DW_AT_decl_file   : 6
    <540>   DW_AT_decl_line   : 110
    <541>   DW_AT_decl_column : 14
    <542>   DW_AT_type        : <0x506>
    <546>   DW_AT_data_member_location: 8
 <2><547>: Abbrev Number: 0
 <1><548>: Abbrev Number: 3 (DW_TAG_typedef)
    <549>   DW_AT_name        : (indirect string, offset: 0x595): sem_t
    <54d>   DW_AT_decl_file   : 6
    <54e>   DW_AT_decl_line   : 121
    <54f>   DW_AT_decl_column : 22
    <550>   DW_AT_type        : <0x513>
 <1><554>: Abbrev Number: 12 (DW_TAG_structure_type)
    <555>   DW_AT_name        : (indirect string, offset: 0x70b): mutex_s
    <559>   DW_AT_byte_size   : 32
    <55a>   DW_AT_decl_file   : 7
    <55b>   DW_AT_decl_line   : 46
    <55c>   DW_AT_decl_column : 8
    <55d>   DW_AT_sibling     : <0x57c>
 <2><561>: Abbrev Number: 14 (DW_TAG_member)
    <562>   DW_AT_name        : sem
    <566>   DW_AT_decl_file   : 7
    <567>   DW_AT_decl_line   : 48
    <568>   DW_AT_decl_column : 9
    <569>   DW_AT_type        : <0x548>
    <56d>   DW_AT_data_member_location: 0
 <2><56e>: Abbrev Number: 13 (DW_TAG_member)
    <56f>   DW_AT_name        : (indirect string, offset: 0x5f2): holder
    <573>   DW_AT_decl_file   : 7
    <574>   DW_AT_decl_line   : 49
    <575>   DW_AT_decl_column : 9
    <576>   DW_AT_type        : <0x465>
    <57a>   DW_AT_data_member_location: 24
 <2><57b>: Abbrev Number: 0
 <1><57c>: Abbrev Number: 3 (DW_TAG_typedef)
    <57d>   DW_AT_name        : (indirect string, offset: 0x610): mutex_t
    <581>   DW_AT_decl_file   : 7
    <582>   DW_AT_decl_line   : 52
    <583>   DW_AT_decl_column : 24
    <584>   DW_AT_type        : <0x554>
 <1><588>: Abbrev Number: 12 (DW_TAG_structure_type)
    <589>   DW_AT_name        : (indirect string, offset: 0x819): rmutex_s
    <58d>   DW_AT_byte_size   : 40
    <58e>   DW_AT_decl_file   : 7
    <58f>   DW_AT_decl_line   : 54
    <590>   DW_AT_decl_column : 8
    <591>   DW_AT_sibling     : <0x5b0>
 <2><595>: Abbrev Number: 13 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0x6ed): mutex
    <59a>   DW_AT_decl_file   : 7
    <59b>   DW_AT_decl_line   : 56
    <59c>   DW_AT_decl_column : 11
    <59d>   DW_AT_type        : <0x57c>
    <5a1>   DW_AT_data_member_location: 0
 <2><5a2>: Abbrev Number: 13 (DW_TAG_member)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x7a0): count
    <5a7>   DW_AT_decl_file   : 7
    <5a8>   DW_AT_decl_line   : 57
    <5a9>   DW_AT_decl_column : 16
    <5aa>   DW_AT_type        : <0x3e4>
    <5ae>   DW_AT_data_member_location: 32
 <2><5af>: Abbrev Number: 0
 <1><5b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <5b1>   DW_AT_name        : (indirect string, offset: 0x822): rmutex_t
    <5b5>   DW_AT_decl_file   : 7
    <5b6>   DW_AT_decl_line   : 60
    <5b7>   DW_AT_decl_column : 25
    <5b8>   DW_AT_type        : <0x588>
 <1><5bc>: Abbrev Number: 2 (DW_TAG_base_type)
    <5bd>   DW_AT_byte_size   : 8
    <5be>   DW_AT_encoding    : 5	(signed)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x5ba): long long int
 <1><5c3>: Abbrev Number: 2 (DW_TAG_base_type)
    <5c4>   DW_AT_byte_size   : 16
    <5c5>   DW_AT_encoding    : 4	(float)
    <5c6>   DW_AT_name        : (indirect string, offset: 0x642): long double
 <1><5ca>: Abbrev Number: 2 (DW_TAG_base_type)
    <5cb>   DW_AT_byte_size   : 1
    <5cc>   DW_AT_encoding    : 2	(boolean)
    <5cd>   DW_AT_name        : (indirect string, offset: 0x72c): _Bool
 <1><5d1>: Abbrev Number: 11 (DW_TAG_typedef)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x5f9): cookie_read_function_t
    <5d6>   DW_AT_decl_file   : 8
    <5d7>   DW_AT_decl_line   : 441
    <5d9>   DW_AT_decl_column : 22
    <5da>   DW_AT_type        : <0x5de>
 <1><5de>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <5df>   DW_AT_prototyped  : 1
    <5df>   DW_AT_type        : <0x459>
    <5e3>   DW_AT_sibling     : <0x5f7>
 <2><5e7>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <5e8>   DW_AT_type        : <0x47d>
 <2><5ec>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <5ed>   DW_AT_type        : <0x47f>
 <2><5f1>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <5f2>   DW_AT_type        : <0x44d>
 <2><5f6>: Abbrev Number: 0
 <1><5f7>: Abbrev Number: 11 (DW_TAG_typedef)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x45f): cookie_write_function_t
    <5fc>   DW_AT_decl_file   : 8
    <5fd>   DW_AT_decl_line   : 443
    <5ff>   DW_AT_decl_column : 22
    <600>   DW_AT_type        : <0x604>
 <1><604>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <605>   DW_AT_prototyped  : 1
    <605>   DW_AT_type        : <0x459>
    <609>   DW_AT_sibling     : <0x61d>
 <2><60d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <60e>   DW_AT_type        : <0x47d>
 <2><612>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <613>   DW_AT_type        : <0x491>
 <2><617>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <618>   DW_AT_type        : <0x44d>
 <2><61c>: Abbrev Number: 0
 <1><61d>: Abbrev Number: 11 (DW_TAG_typedef)
    <61e>   DW_AT_name        : (indirect string, offset: 0x768): cookie_seek_function_t
    <622>   DW_AT_decl_file   : 8
    <623>   DW_AT_decl_line   : 446
    <625>   DW_AT_decl_column : 20
    <626>   DW_AT_type        : <0x62a>
 <1><62a>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <62b>   DW_AT_prototyped  : 1
    <62b>   DW_AT_type        : <0x471>
    <62f>   DW_AT_sibling     : <0x643>
 <2><633>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <634>   DW_AT_type        : <0x47d>
 <2><638>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <639>   DW_AT_type        : <0x643>
 <2><63d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <63e>   DW_AT_type        : <0x3dd>
 <2><642>: Abbrev Number: 0
 <1><643>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <644>   DW_AT_byte_size   : 8
    <645>   DW_AT_type        : <0x471>
 <1><649>: Abbrev Number: 11 (DW_TAG_typedef)
    <64a>   DW_AT_name        : (indirect string, offset: 0x488): cookie_close_function_t
    <64e>   DW_AT_decl_file   : 8
    <64f>   DW_AT_decl_line   : 449
    <651>   DW_AT_decl_column : 18
    <652>   DW_AT_type        : <0x656>
 <1><656>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <657>   DW_AT_prototyped  : 1
    <657>   DW_AT_type        : <0x3dd>
    <65b>   DW_AT_sibling     : <0x665>
 <2><65f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <660>   DW_AT_type        : <0x47d>
 <2><664>: Abbrev Number: 0
 <1><665>: Abbrev Number: 9 (DW_TAG_structure_type)
    <666>   DW_AT_name        : (indirect string, offset: 0x579): cookie_io_functions_t
    <66a>   DW_AT_byte_size   : 32
    <66b>   DW_AT_decl_file   : 8
    <66c>   DW_AT_decl_line   : 451
    <66e>   DW_AT_decl_column : 16
    <66f>   DW_AT_sibling     : <0x6ac>
 <2><673>: Abbrev Number: 10 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0x5b5): read
    <678>   DW_AT_decl_file   : 8
    <679>   DW_AT_decl_line   : 453
    <67b>   DW_AT_decl_column : 31
    <67c>   DW_AT_type        : <0x6ac>
    <680>   DW_AT_data_member_location: 0
 <2><681>: Abbrev Number: 10 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x7a6): write
    <686>   DW_AT_decl_file   : 8
    <687>   DW_AT_decl_line   : 454
    <689>   DW_AT_decl_column : 32
    <68a>   DW_AT_type        : <0x6b2>
    <68e>   DW_AT_data_member_location: 8
 <2><68f>: Abbrev Number: 10 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x7b8): seek
    <694>   DW_AT_decl_file   : 8
    <695>   DW_AT_decl_line   : 455
    <697>   DW_AT_decl_column : 31
    <698>   DW_AT_type        : <0x6b8>
    <69c>   DW_AT_data_member_location: 16
 <2><69d>: Abbrev Number: 10 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x40b): close
    <6a2>   DW_AT_decl_file   : 8
    <6a3>   DW_AT_decl_line   : 456
    <6a5>   DW_AT_decl_column : 32
    <6a6>   DW_AT_type        : <0x6be>
    <6aa>   DW_AT_data_member_location: 24
 <2><6ab>: Abbrev Number: 0
 <1><6ac>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6ad>   DW_AT_byte_size   : 8
    <6ae>   DW_AT_type        : <0x5d1>
 <1><6b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6b3>   DW_AT_byte_size   : 8
    <6b4>   DW_AT_type        : <0x5f7>
 <1><6b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6b9>   DW_AT_byte_size   : 8
    <6ba>   DW_AT_type        : <0x61d>
 <1><6be>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6bf>   DW_AT_byte_size   : 8
    <6c0>   DW_AT_type        : <0x649>
 <1><6c4>: Abbrev Number: 11 (DW_TAG_typedef)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x579): cookie_io_functions_t
    <6c9>   DW_AT_decl_file   : 8
    <6ca>   DW_AT_decl_line   : 457
    <6cc>   DW_AT_decl_column : 3
    <6cd>   DW_AT_type        : <0x665>
 <1><6d1>: Abbrev Number: 9 (DW_TAG_structure_type)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x618): file_struct
    <6d6>   DW_AT_byte_size   : 192
    <6d7>   DW_AT_decl_file   : 8
    <6d8>   DW_AT_decl_line   : 526
    <6da>   DW_AT_decl_column : 8
    <6db>   DW_AT_sibling     : <0x796>
 <2><6df>: Abbrev Number: 10 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x732): fs_next
    <6e4>   DW_AT_decl_file   : 8
    <6e5>   DW_AT_decl_line   : 528
    <6e7>   DW_AT_decl_column : 27
    <6e8>   DW_AT_type        : <0x796>
    <6ec>   DW_AT_data_member_location: 0
 <2><6ed>: Abbrev Number: 10 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x7bd): fs_lock
    <6f2>   DW_AT_decl_file   : 8
    <6f3>   DW_AT_decl_line   : 529
    <6f5>   DW_AT_decl_column : 27
    <6f6>   DW_AT_type        : <0x5b0>
    <6fa>   DW_AT_data_member_location: 8
 <2><6fb>: Abbrev Number: 10 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x74f): fs_iofunc
    <700>   DW_AT_decl_file   : 8
    <701>   DW_AT_decl_line   : 530
    <703>   DW_AT_decl_column : 27
    <704>   DW_AT_type        : <0x6c4>
    <708>   DW_AT_data_member_location: 48
 <2><709>: Abbrev Number: 10 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0x745): fs_cookie
    <70e>   DW_AT_decl_file   : 8
    <70f>   DW_AT_decl_line   : 531
    <711>   DW_AT_decl_column : 27
    <712>   DW_AT_type        : <0x47d>
    <716>   DW_AT_data_member_location: 80
 <2><717>: Abbrev Number: 10 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x7ac): fs_bufstart
    <71c>   DW_AT_decl_file   : 8
    <71d>   DW_AT_decl_line   : 533
    <71f>   DW_AT_decl_column : 27
    <720>   DW_AT_type        : <0x47f>
    <724>   DW_AT_data_member_location: 88
 <2><725>: Abbrev Number: 10 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x562): fs_bufend
    <72a>   DW_AT_decl_file   : 8
    <72b>   DW_AT_decl_line   : 534
    <72d>   DW_AT_decl_column : 27
    <72e>   DW_AT_type        : <0x47f>
    <732>   DW_AT_data_member_location: 96
 <2><733>: Abbrev Number: 10 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x5a6): fs_bufpos
    <738>   DW_AT_decl_file   : 8
    <739>   DW_AT_decl_line   : 535
    <73b>   DW_AT_decl_column : 27
    <73c>   DW_AT_type        : <0x47f>
    <740>   DW_AT_data_member_location: 104
 <2><741>: Abbrev Number: 10 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x59b): fs_bufread
    <746>   DW_AT_decl_file   : 8
    <747>   DW_AT_decl_line   : 536
    <749>   DW_AT_decl_column : 27
    <74a>   DW_AT_type        : <0x47f>
    <74e>   DW_AT_data_member_location: 112
 <2><74f>: Abbrev Number: 10 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x77f): fs_buffer
    <754>   DW_AT_decl_file   : 8
    <755>   DW_AT_decl_line   : 538
    <757>   DW_AT_decl_column : 27
    <758>   DW_AT_type        : <0x79c>
    <75c>   DW_AT_data_member_location: 120
 <2><75d>: Abbrev Number: 10 (DW_TAG_member)
    <75e>   DW_AT_name        : (indirect string, offset: 0x6de): fs_oflags
    <762>   DW_AT_decl_file   : 8
    <763>   DW_AT_decl_line   : 541
    <765>   DW_AT_decl_column : 27
    <766>   DW_AT_type        : <0x435>
    <76a>   DW_AT_data_member_location: 184
 <2><76b>: Abbrev Number: 10 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x805): fs_flags
    <770>   DW_AT_decl_file   : 8
    <771>   DW_AT_decl_line   : 542
    <773>   DW_AT_decl_column : 27
    <774>   DW_AT_type        : <0x418>
    <778>   DW_AT_data_member_location: 186
 <2><779>: Abbrev Number: 10 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0x7df): fs_nungotten
    <77e>   DW_AT_decl_file   : 8
    <77f>   DW_AT_decl_line   : 544
    <781>   DW_AT_decl_column : 27
    <782>   DW_AT_type        : <0x418>
    <786>   DW_AT_data_member_location: 187
 <2><787>: Abbrev Number: 10 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x426): fs_ungotten
    <78c>   DW_AT_decl_file   : 8
    <78d>   DW_AT_decl_line   : 545
    <78f>   DW_AT_decl_column : 27
    <790>   DW_AT_type        : <0x7ac>
    <794>   DW_AT_data_member_location: 188
 <2><795>: Abbrev Number: 0
 <1><796>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <797>   DW_AT_byte_size   : 8
    <798>   DW_AT_type        : <0x6d1>
 <1><79c>: Abbrev Number: 17 (DW_TAG_array_type)
    <79d>   DW_AT_type        : <0x485>
    <7a1>   DW_AT_sibling     : <0x7ac>
 <2><7a5>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <7a6>   DW_AT_type        : <0x3f2>
    <7aa>   DW_AT_upper_bound : 63
 <2><7ab>: Abbrev Number: 0
 <1><7ac>: Abbrev Number: 17 (DW_TAG_array_type)
    <7ad>   DW_AT_type        : <0x485>
    <7b1>   DW_AT_sibling     : <0x7bc>
 <2><7b5>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <7b6>   DW_AT_type        : <0x3f2>
    <7ba>   DW_AT_upper_bound : 1
 <2><7bb>: Abbrev Number: 0
 <1><7bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x5b0): FILE
    <7c1>   DW_AT_decl_file   : 9
    <7c2>   DW_AT_decl_line   : 112
    <7c3>   DW_AT_decl_column : 28
    <7c4>   DW_AT_type        : <0x6d1>
 <1><7c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7c9>   DW_AT_byte_size   : 8
    <7ca>   DW_AT_type        : <0x7bc>
 <1><7ce>: Abbrev Number: 19 (DW_TAG_subprogram)
    <7cf>   DW_AT_external    : 1
    <7cf>   DW_AT_name        : (indirect string, offset: 0x6e8): puts
    <7d3>   DW_AT_decl_file   : 9
    <7d4>   DW_AT_decl_line   : 208
    <7d5>   DW_AT_decl_column : 8
    <7d6>   DW_AT_prototyped  : 1
    <7d6>   DW_AT_type        : <0x3dd>
    <7da>   DW_AT_low_pc      : 0x5a
    <7e2>   DW_AT_high_pc     : 0x86
    <7ea>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7ec>   DW_AT_GNU_all_call_sites: 1
    <7ec>   DW_AT_sibling     : <0x90c>
 <2><7f0>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <7f1>   DW_AT_name        : s
    <7f3>   DW_AT_decl_file   : 1
    <7f4>   DW_AT_decl_line   : 43
    <7f5>   DW_AT_decl_column : 31
    <7f6>   DW_AT_type        : <0x491>
    <7fa>   DW_AT_location    : 0x107 (location list)
 <2><7fe>: Abbrev Number: 21 (DW_TAG_variable)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x624): stream
    <803>   DW_AT_decl_file   : 1
    <804>   DW_AT_decl_line   : 46
    <805>   DW_AT_decl_column : 9
    <806>   DW_AT_type        : <0x7c8>
    <80a>   DW_AT_location    : 0x153 (location list)
 <2><80e>: Abbrev Number: 21 (DW_TAG_variable)
    <80f>   DW_AT_name        : (indirect string, offset: 0x456): nwritten
    <813>   DW_AT_decl_file   : 1
    <814>   DW_AT_decl_line   : 47
    <815>   DW_AT_decl_column : 7
    <816>   DW_AT_type        : <0x3dd>
    <81a>   DW_AT_location    : 0x176 (location list)
 <2><81e>: Abbrev Number: 21 (DW_TAG_variable)
    <81f>   DW_AT_name        : (indirect string, offset: 0x7d0): nput
    <823>   DW_AT_decl_file   : 1
    <824>   DW_AT_decl_line   : 48
    <825>   DW_AT_decl_column : 7
    <826>   DW_AT_type        : <0x3dd>
    <82a>   DW_AT_location    : 0x199 (location list)
 <2><82e>: Abbrev Number: 22 (DW_TAG_variable)
    <82f>   DW_AT_name        : ret
    <833>   DW_AT_decl_file   : 1
    <834>   DW_AT_decl_line   : 49
    <835>   DW_AT_decl_column : 7
    <836>   DW_AT_type        : <0x3dd>
    <83a>   DW_AT_location    : 0x1d1 (location list)
 <2><83e>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <83f>   DW_AT_low_pc      : 0x88
    <847>   DW_AT_high_pc     : 0x38
    <84f>   DW_AT_sibling     : <0x89a>
 <3><853>: Abbrev Number: 24 (DW_TAG_variable)
    <854>   DW_AT_name        : (indirect string, offset: 0x5ea): newline
    <858>   DW_AT_decl_file   : 1
    <859>   DW_AT_decl_line   : 62
    <85a>   DW_AT_decl_column : 12
    <85b>   DW_AT_type        : <0x485>
    <85f>   DW_AT_location    : 2 byte block: 91 5f 	(DW_OP_fbreg: -33)
 <3><862>: Abbrev Number: 25 (DW_TAG_GNU_call_site)
    <863>   DW_AT_low_pc      : 0xa0
    <86b>   DW_AT_abstract_origin: <0x90c>
    <86f>   DW_AT_sibling     : <0x885>
 <4><873>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <874>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <876>   DW_AT_GNU_call_site_value: 2 byte block: 91 5f 	(DW_OP_fbreg: -33)
 <4><879>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <87a>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <87c>   DW_AT_GNU_call_site_value: 1 byte block: 31 	(DW_OP_lit1)
 <4><87e>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <87f>   DW_AT_location    : 1 byte block: 5c 	(DW_OP_reg12 (a2))
    <881>   DW_AT_GNU_call_site_value: 2 byte block: 79 0 	(DW_OP_breg9 (s1): 0)
 <4><884>: Abbrev Number: 0
 <3><885>: Abbrev Number: 27 (DW_TAG_GNU_call_site)
    <886>   DW_AT_low_pc      : 0xba
    <88e>   DW_AT_abstract_origin: <0x918>
 <4><892>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <893>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <895>   DW_AT_GNU_call_site_value: 2 byte block: 79 0 	(DW_OP_breg9 (s1): 0)
 <4><898>: Abbrev Number: 0
 <3><899>: Abbrev Number: 0
 <2><89a>: Abbrev Number: 25 (DW_TAG_GNU_call_site)
    <89b>   DW_AT_low_pc      : 0x6e
    <8a3>   DW_AT_abstract_origin: <0x924>
    <8a7>   DW_AT_sibling     : <0x8b1>
 <3><8ab>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <8ac>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <8ae>   DW_AT_GNU_call_site_value: 1 byte block: 31 	(DW_OP_lit1)
 <3><8b0>: Abbrev Number: 0
 <2><8b1>: Abbrev Number: 25 (DW_TAG_GNU_call_site)
    <8b2>   DW_AT_low_pc      : 0x78
    <8ba>   DW_AT_abstract_origin: <0x930>
    <8be>   DW_AT_sibling     : <0x8c9>
 <3><8c2>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <8c3>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <8c5>   DW_AT_GNU_call_site_value: 2 byte block: 79 0 	(DW_OP_breg9 (s1): 0)
 <3><8c8>: Abbrev Number: 0
 <2><8c9>: Abbrev Number: 25 (DW_TAG_GNU_call_site)
    <8ca>   DW_AT_low_pc      : 0x84
    <8d2>   DW_AT_abstract_origin: <0x93c>
    <8d6>   DW_AT_sibling     : <0x8e7>
 <3><8da>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <8db>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <8dd>   DW_AT_GNU_call_site_value: 2 byte block: 78 0 	(DW_OP_breg8 (s0): 0)
 <3><8e0>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <8e1>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <8e3>   DW_AT_GNU_call_site_value: 2 byte block: 79 0 	(DW_OP_breg9 (s1): 0)
 <3><8e6>: Abbrev Number: 0
 <2><8e7>: Abbrev Number: 25 (DW_TAG_GNU_call_site)
    <8e8>   DW_AT_low_pc      : 0xcc
    <8f0>   DW_AT_abstract_origin: <0x924>
    <8f4>   DW_AT_sibling     : <0x8fe>
 <3><8f8>: Abbrev Number: 26 (DW_TAG_GNU_call_site_parameter)
    <8f9>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <8fb>   DW_AT_GNU_call_site_value: 1 byte block: 31 	(DW_OP_lit1)
 <3><8fd>: Abbrev Number: 0
 <2><8fe>: Abbrev Number: 28 (DW_TAG_GNU_call_site)
    <8ff>   DW_AT_low_pc      : 0xd4
    <907>   DW_AT_abstract_origin: <0x948>
 <2><90b>: Abbrev Number: 0
 <1><90c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <90d>   DW_AT_external    : 1
    <90d>   DW_AT_declaration : 1
    <90d>   DW_AT_linkage_name: (indirect string, offset: 0x681): lib_fwrite_unlocked
    <911>   DW_AT_name        : (indirect string, offset: 0x681): lib_fwrite_unlocked
    <915>   DW_AT_decl_file   : 10
    <916>   DW_AT_decl_line   : 193
    <917>   DW_AT_decl_column : 9
 <1><918>: Abbrev Number: 29 (DW_TAG_subprogram)
    <919>   DW_AT_external    : 1
    <919>   DW_AT_declaration : 1
    <919>   DW_AT_linkage_name: (indirect string, offset: 0x43b): lib_fflush_unlocked
    <91d>   DW_AT_name        : (indirect string, offset: 0x43b): lib_fflush_unlocked
    <921>   DW_AT_decl_file   : 10
    <922>   DW_AT_decl_line   : 222
    <923>   DW_AT_decl_column : 9
 <1><924>: Abbrev Number: 29 (DW_TAG_subprogram)
    <925>   DW_AT_external    : 1
    <925>   DW_AT_declaration : 1
    <925>   DW_AT_linkage_name: (indirect string, offset: 0x417): lib_get_stream
    <929>   DW_AT_name        : (indirect string, offset: 0x417): lib_get_stream
    <92d>   DW_AT_decl_file   : 11
    <92e>   DW_AT_decl_line   : 112
    <92f>   DW_AT_decl_column : 25
 <1><930>: Abbrev Number: 29 (DW_TAG_subprogram)
    <931>   DW_AT_external    : 1
    <931>   DW_AT_declaration : 1
    <931>   DW_AT_linkage_name: (indirect string, offset: 0x657): flockfile
    <935>   DW_AT_name        : (indirect string, offset: 0x657): flockfile
    <939>   DW_AT_decl_file   : 9
    <93a>   DW_AT_decl_line   : 194
    <93b>   DW_AT_decl_column : 6
 <1><93c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <93d>   DW_AT_external    : 1
    <93d>   DW_AT_declaration : 1
    <93d>   DW_AT_linkage_name: (indirect string, offset: 0x759): fputs_unlocked
    <941>   DW_AT_name        : (indirect string, offset: 0x759): fputs_unlocked
    <945>   DW_AT_decl_file   : 9
    <946>   DW_AT_decl_line   : 160
    <947>   DW_AT_decl_column : 8
 <1><948>: Abbrev Number: 29 (DW_TAG_subprogram)
    <949>   DW_AT_external    : 1
    <949>   DW_AT_declaration : 1
    <949>   DW_AT_linkage_name: (indirect string, offset: 0x7f9): funlockfile
    <94d>   DW_AT_name        : (indirect string, offset: 0x7f9): funlockfile
    <951>   DW_AT_decl_file   : 9
    <952>   DW_AT_decl_line   : 196
    <953>   DW_AT_decl_column : 6
 <1><954>: Abbrev Number: 0
  Compilation Unit @ offset 0x955:
   Length:        0x73b (32-bit)
   Version:       4
   Abbrev Offset: 0x358
   Pointer Size:  8
 <0><960>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <961>   DW_AT_producer    : (indirect string, offset: 0x8fe): GNU C17 10.2.0 -mcmodel=medany -march=rv64imafdc -mabi=lp64d -march=rv64imafdc -g -Os -fno-common -fno-strict-aliasing -fomit-frame-pointer -ffunction-sections -fdata-sections
    <965>   DW_AT_language    : 12	(ANSI C99)
    <966>   DW_AT_name        : (indirect string, offset: 0xae2): stdio/lib_libfwrite.c
    <96a>   DW_AT_comp_dir    : (indirect string, offset: 0xa25): /Users/Luppy/ox64/nuttx/libs/libc
    <96e>   DW_AT_ranges      : 0x70
    <972>   DW_AT_low_pc      : 0x0
    <97a>   DW_AT_stmt_list   : 0x4cd
 <1><97e>: Abbrev Number: 2 (DW_TAG_base_type)
    <97f>   DW_AT_byte_size   : 1
    <980>   DW_AT_encoding    : 6	(signed char)
    <981>   DW_AT_name        : (indirect string, offset: 0xa01): signed char
 <1><985>: Abbrev Number: 3 (DW_TAG_typedef)
    <986>   DW_AT_name        : (indirect string, offset: 0x86a): _uint8_t
    <98a>   DW_AT_decl_file   : 2
    <98b>   DW_AT_decl_line   : 52
    <98c>   DW_AT_decl_column : 28
    <98d>   DW_AT_type        : <0x991>
 <1><991>: Abbrev Number: 2 (DW_TAG_base_type)
    <992>   DW_AT_byte_size   : 1
    <993>   DW_AT_encoding    : 8	(unsigned char)
    <994>   DW_AT_name        : (indirect string, offset: 0xacb): unsigned char
 <1><998>: Abbrev Number: 3 (DW_TAG_typedef)
    <999>   DW_AT_name        : (indirect string, offset: 0xad9): _int16_t
    <99d>   DW_AT_decl_file   : 2
    <99e>   DW_AT_decl_line   : 54
    <99f>   DW_AT_decl_column : 28
    <9a0>   DW_AT_type        : <0x9a4>
 <1><9a4>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a5>   DW_AT_byte_size   : 2
    <9a6>   DW_AT_encoding    : 5	(signed)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x8f4): short int
 <1><9ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ac>   DW_AT_name        : (indirect string, offset: 0xc46): _uint16_t
    <9b0>   DW_AT_decl_file   : 2
    <9b1>   DW_AT_decl_line   : 55
    <9b2>   DW_AT_decl_column : 28
    <9b3>   DW_AT_type        : <0x9b7>
 <1><9b7>: Abbrev Number: 2 (DW_TAG_base_type)
    <9b8>   DW_AT_byte_size   : 2
    <9b9>   DW_AT_encoding    : 7	(unsigned)
    <9ba>   DW_AT_name        : (indirect string, offset: 0xb71): short unsigned int
 <1><9be>: Abbrev Number: 3 (DW_TAG_typedef)
    <9bf>   DW_AT_name        : (indirect string, offset: 0xab8): _int32_t
    <9c3>   DW_AT_decl_file   : 2
    <9c4>   DW_AT_decl_line   : 58
    <9c5>   DW_AT_decl_column : 28
    <9c6>   DW_AT_type        : <0x9ca>
 <1><9ca>: Abbrev Number: 4 (DW_TAG_base_type)
    <9cb>   DW_AT_byte_size   : 4
    <9cc>   DW_AT_encoding    : 5	(signed)
    <9cd>   DW_AT_name        : int
 <1><9d1>: Abbrev Number: 2 (DW_TAG_base_type)
    <9d2>   DW_AT_byte_size   : 4
    <9d3>   DW_AT_encoding    : 7	(unsigned)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xc5d): unsigned int
 <1><9d8>: Abbrev Number: 2 (DW_TAG_base_type)
    <9d9>   DW_AT_byte_size   : 8
    <9da>   DW_AT_encoding    : 5	(signed)
    <9db>   DW_AT_name        : (indirect string, offset: 0xb91): long int
 <1><9df>: Abbrev Number: 2 (DW_TAG_base_type)
    <9e0>   DW_AT_byte_size   : 8
    <9e1>   DW_AT_encoding    : 7	(unsigned)
    <9e2>   DW_AT_name        : (indirect string, offset: 0xb49): long unsigned int
 <1><9e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e7>   DW_AT_name        : (indirect string, offset: 0xc9f): _ssize_t
    <9eb>   DW_AT_decl_file   : 2
    <9ec>   DW_AT_decl_line   : 91
    <9ed>   DW_AT_decl_column : 28
    <9ee>   DW_AT_type        : <0x9d8>
 <1><9f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xc14): _size_t
    <9f7>   DW_AT_decl_file   : 2
    <9f8>   DW_AT_decl_line   : 93
    <9f9>   DW_AT_decl_column : 28
    <9fa>   DW_AT_type        : <0x9df>
 <1><9fe>: Abbrev Number: 2 (DW_TAG_base_type)
    <9ff>   DW_AT_byte_size   : 8
    <a00>   DW_AT_encoding    : 7	(unsigned)
    <a01>   DW_AT_name        : (indirect string, offset: 0xb24): long long unsigned int
 <1><a05>: Abbrev Number: 3 (DW_TAG_typedef)
    <a06>   DW_AT_name        : (indirect string, offset: 0x9b8): uint8_t
    <a0a>   DW_AT_decl_file   : 3
    <a0b>   DW_AT_decl_line   : 166
    <a0c>   DW_AT_decl_column : 29
    <a0d>   DW_AT_type        : <0x985>
 <1><a11>: Abbrev Number: 3 (DW_TAG_typedef)
    <a12>   DW_AT_name        : (indirect string, offset: 0xba2): int16_t
    <a16>   DW_AT_decl_file   : 3
    <a17>   DW_AT_decl_line   : 168
    <a18>   DW_AT_decl_column : 29
    <a19>   DW_AT_type        : <0x998>
 <1><a1d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a1e>   DW_AT_type        : <0xa11>
 <1><a22>: Abbrev Number: 3 (DW_TAG_typedef)
    <a23>   DW_AT_name        : (indirect string, offset: 0xb40): uint16_t
    <a27>   DW_AT_decl_file   : 3
    <a28>   DW_AT_decl_line   : 169
    <a29>   DW_AT_decl_column : 29
    <a2a>   DW_AT_type        : <0x9ab>
 <1><a2e>: Abbrev Number: 3 (DW_TAG_typedef)
    <a2f>   DW_AT_name        : (indirect string, offset: 0xb9a): int32_t
    <a33>   DW_AT_decl_file   : 3
    <a34>   DW_AT_decl_line   : 176
    <a35>   DW_AT_decl_column : 29
    <a36>   DW_AT_type        : <0x9be>
 <1><a3a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x8a3): intptr_t
    <a3f>   DW_AT_decl_file   : 3
    <a40>   DW_AT_decl_line   : 238
    <a41>   DW_AT_decl_column : 29
    <a42>   DW_AT_type        : <0x9e6>
 <1><a46>: Abbrev Number: 3 (DW_TAG_typedef)
    <a47>   DW_AT_name        : (indirect string, offset: 0x9d6): uintptr_t
    <a4b>   DW_AT_decl_file   : 3
    <a4c>   DW_AT_decl_line   : 239
    <a4d>   DW_AT_decl_column : 29
    <a4e>   DW_AT_type        : <0x9f2>
 <1><a52>: Abbrev Number: 3 (DW_TAG_typedef)
    <a53>   DW_AT_name        : (indirect string, offset: 0x89c): size_t
    <a57>   DW_AT_decl_file   : 4
    <a58>   DW_AT_decl_line   : 133
    <a59>   DW_AT_decl_column : 22
    <a5a>   DW_AT_type        : <0x9f2>
 <1><a5e>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5f>   DW_AT_name        : (indirect string, offset: 0x8ec): ssize_t
    <a63>   DW_AT_decl_file   : 4
    <a64>   DW_AT_decl_line   : 134
    <a65>   DW_AT_decl_column : 22
    <a66>   DW_AT_type        : <0x9e6>
 <1><a6a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xbee): pid_t
    <a6f>   DW_AT_decl_file   : 4
    <a70>   DW_AT_decl_line   : 162
    <a71>   DW_AT_decl_column : 22
    <a72>   DW_AT_type        : <0x9ca>
 <1><a76>: Abbrev Number: 3 (DW_TAG_typedef)
    <a77>   DW_AT_name        : (indirect string, offset: 0xc08): off_t
    <a7b>   DW_AT_decl_file   : 4
    <a7c>   DW_AT_decl_line   : 229
    <a7d>   DW_AT_decl_column : 22
    <a7e>   DW_AT_type        : <0xa2e>
 <1><a82>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a83>   DW_AT_byte_size   : 8
 <1><a84>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a85>   DW_AT_byte_size   : 8
    <a86>   DW_AT_type        : <0xa8a>
 <1><a8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <a8b>   DW_AT_byte_size   : 1
    <a8c>   DW_AT_encoding    : 8	(unsigned char)
    <a8d>   DW_AT_name        : (indirect string, offset: 0xb84): char
 <1><a91>: Abbrev Number: 8 (DW_TAG_const_type)
    <a92>   DW_AT_type        : <0xa8a>
 <1><a96>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <a97>   DW_AT_encoding    : 5	(signed)
    <a98>   DW_AT_byte_size   : 4
    <a99>   DW_AT_type        : <0x9ca>
    <a9d>   DW_AT_decl_file   : 4
    <a9e>   DW_AT_decl_line   : 321
    <aa0>   DW_AT_decl_column : 1
    <aa1>   DW_AT_sibling     : <0xab1>
 <2><aa5>: Abbrev Number: 10 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0xa8b): ERROR
    <aaa>   DW_AT_const_value : -1
 <2><aab>: Abbrev Number: 11 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : OK
    <aaf>   DW_AT_const_value : 0
 <2><ab0>: Abbrev Number: 0
 <1><ab1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ab2>   DW_AT_byte_size   : 8
    <ab3>   DW_AT_type        : <0xa91>
 <1><ab7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xaa1): dq_entry_s
    <abc>   DW_AT_byte_size   : 16
    <abd>   DW_AT_decl_file   : 5
    <abe>   DW_AT_decl_line   : 303
    <ac0>   DW_AT_decl_column : 8
    <ac1>   DW_AT_sibling     : <0xae2>
 <2><ac5>: Abbrev Number: 13 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0xa91): flink
    <aca>   DW_AT_decl_file   : 5
    <acb>   DW_AT_decl_line   : 305
    <acd>   DW_AT_decl_column : 26
    <ace>   DW_AT_type        : <0xae2>
    <ad2>   DW_AT_data_member_location: 0
 <2><ad3>: Abbrev Number: 13 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x852): blink
    <ad8>   DW_AT_decl_file   : 5
    <ad9>   DW_AT_decl_line   : 306
    <adb>   DW_AT_decl_column : 26
    <adc>   DW_AT_type        : <0xae2>
    <ae0>   DW_AT_data_member_location: 8
 <2><ae1>: Abbrev Number: 0
 <1><ae2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ae3>   DW_AT_byte_size   : 8
    <ae4>   DW_AT_type        : <0xab7>
 <1><ae8>: Abbrev Number: 14 (DW_TAG_typedef)
    <ae9>   DW_AT_name        : (indirect string, offset: 0xbb8): dq_entry_t
    <aed>   DW_AT_decl_file   : 5
    <aee>   DW_AT_decl_line   : 308
    <af0>   DW_AT_decl_column : 27
    <af1>   DW_AT_type        : <0xab7>
 <1><af5>: Abbrev Number: 12 (DW_TAG_structure_type)
    <af6>   DW_AT_name        : (indirect string, offset: 0xc1c): dq_queue_s
    <afa>   DW_AT_byte_size   : 16
    <afb>   DW_AT_decl_file   : 5
    <afc>   DW_AT_decl_line   : 317
    <afe>   DW_AT_decl_column : 8
    <aff>   DW_AT_sibling     : <0xb20>
 <2><b03>: Abbrev Number: 13 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0x9b3): head
    <b08>   DW_AT_decl_file   : 5
    <b09>   DW_AT_decl_line   : 319
    <b0b>   DW_AT_decl_column : 19
    <b0c>   DW_AT_type        : <0xb20>
    <b10>   DW_AT_data_member_location: 0
 <2><b11>: Abbrev Number: 13 (DW_TAG_member)
    <b12>   DW_AT_name        : (indirect string, offset: 0xb3b): tail
    <b16>   DW_AT_decl_file   : 5
    <b17>   DW_AT_decl_line   : 320
    <b19>   DW_AT_decl_column : 19
    <b1a>   DW_AT_type        : <0xb20>
    <b1e>   DW_AT_data_member_location: 8
 <2><b1f>: Abbrev Number: 0
 <1><b20>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b21>   DW_AT_byte_size   : 8
    <b22>   DW_AT_type        : <0xae8>
 <1><b26>: Abbrev Number: 14 (DW_TAG_typedef)
    <b27>   DW_AT_name        : (indirect string, offset: 0xc2f): dq_queue_t
    <b2b>   DW_AT_decl_file   : 5
    <b2c>   DW_AT_decl_line   : 322
    <b2e>   DW_AT_decl_column : 27
    <b2f>   DW_AT_type        : <0xaf5>
 <1><b33>: Abbrev Number: 15 (DW_TAG_structure_type)
    <b34>   DW_AT_name        : (indirect string, offset: 0x9e0): sem_s
    <b38>   DW_AT_byte_size   : 24
    <b39>   DW_AT_decl_file   : 6
    <b3a>   DW_AT_decl_line   : 99
    <b3b>   DW_AT_decl_column : 8
    <b3c>   DW_AT_sibling     : <0xb68>
 <2><b40>: Abbrev Number: 16 (DW_TAG_member)
    <b41>   DW_AT_name        : (indirect string, offset: 0xaf8): semcount
    <b45>   DW_AT_decl_file   : 6
    <b46>   DW_AT_decl_line   : 101
    <b47>   DW_AT_decl_column : 20
    <b48>   DW_AT_type        : <0xa1d>
    <b4c>   DW_AT_data_member_location: 0
 <2><b4d>: Abbrev Number: 16 (DW_TAG_member)
    <b4e>   DW_AT_name        : (indirect string, offset: 0xb1e): flags
    <b52>   DW_AT_decl_file   : 6
    <b53>   DW_AT_decl_line   : 108
    <b54>   DW_AT_decl_column : 11
    <b55>   DW_AT_type        : <0xa05>
    <b59>   DW_AT_data_member_location: 2
 <2><b5a>: Abbrev Number: 16 (DW_TAG_member)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x8cb): waitlist
    <b5f>   DW_AT_decl_file   : 6
    <b60>   DW_AT_decl_line   : 110
    <b61>   DW_AT_decl_column : 14
    <b62>   DW_AT_type        : <0xb26>
    <b66>   DW_AT_data_member_location: 8
 <2><b67>: Abbrev Number: 0
 <1><b68>: Abbrev Number: 3 (DW_TAG_typedef)
    <b69>   DW_AT_name        : (indirect string, offset: 0x9e6): sem_t
    <b6d>   DW_AT_decl_file   : 6
    <b6e>   DW_AT_decl_line   : 121
    <b6f>   DW_AT_decl_column : 22
    <b70>   DW_AT_type        : <0xb33>
 <1><b74>: Abbrev Number: 15 (DW_TAG_structure_type)
    <b75>   DW_AT_name        : (indirect string, offset: 0xb89): mutex_s
    <b79>   DW_AT_byte_size   : 32
    <b7a>   DW_AT_decl_file   : 7
    <b7b>   DW_AT_decl_line   : 46
    <b7c>   DW_AT_decl_column : 8
    <b7d>   DW_AT_sibling     : <0xb9c>
 <2><b81>: Abbrev Number: 17 (DW_TAG_member)
    <b82>   DW_AT_name        : sem
    <b86>   DW_AT_decl_file   : 7
    <b87>   DW_AT_decl_line   : 48
    <b88>   DW_AT_decl_column : 9
    <b89>   DW_AT_type        : <0xb68>
    <b8d>   DW_AT_data_member_location: 0
 <2><b8e>: Abbrev Number: 16 (DW_TAG_member)
    <b8f>   DW_AT_name        : (indirect string, offset: 0xa47): holder
    <b93>   DW_AT_decl_file   : 7
    <b94>   DW_AT_decl_line   : 49
    <b95>   DW_AT_decl_column : 9
    <b96>   DW_AT_type        : <0xa6a>
    <b9a>   DW_AT_data_member_location: 24
 <2><b9b>: Abbrev Number: 0
 <1><b9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9d>   DW_AT_name        : (indirect string, offset: 0xa65): mutex_t
    <ba1>   DW_AT_decl_file   : 7
    <ba2>   DW_AT_decl_line   : 52
    <ba3>   DW_AT_decl_column : 24
    <ba4>   DW_AT_type        : <0xb74>
 <1><ba8>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ba9>   DW_AT_name        : (indirect string, offset: 0xb15): rmutex_s
    <bad>   DW_AT_byte_size   : 40
    <bae>   DW_AT_decl_file   : 7
    <baf>   DW_AT_decl_line   : 54
    <bb0>   DW_AT_decl_column : 8
    <bb1>   DW_AT_sibling     : <0xbd0>
 <2><bb5>: Abbrev Number: 16 (DW_TAG_member)
    <bb6>   DW_AT_name        : (indirect string, offset: 0xb65): mutex
    <bba>   DW_AT_decl_file   : 7
    <bbb>   DW_AT_decl_line   : 56
    <bbc>   DW_AT_decl_column : 11
    <bbd>   DW_AT_type        : <0xb9c>
    <bc1>   DW_AT_data_member_location: 0
 <2><bc2>: Abbrev Number: 16 (DW_TAG_member)
    <bc3>   DW_AT_name        : (indirect string, offset: 0xc0e): count
    <bc7>   DW_AT_decl_file   : 7
    <bc8>   DW_AT_decl_line   : 57
    <bc9>   DW_AT_decl_column : 16
    <bca>   DW_AT_type        : <0x9d1>
    <bce>   DW_AT_data_member_location: 32
 <2><bcf>: Abbrev Number: 0
 <1><bd0>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd1>   DW_AT_name        : (indirect string, offset: 0xc96): rmutex_t
    <bd5>   DW_AT_decl_file   : 7
    <bd6>   DW_AT_decl_line   : 60
    <bd7>   DW_AT_decl_column : 25
    <bd8>   DW_AT_type        : <0xba8>
 <1><bdc>: Abbrev Number: 2 (DW_TAG_base_type)
    <bdd>   DW_AT_byte_size   : 8
    <bde>   DW_AT_encoding    : 5	(signed)
    <bdf>   DW_AT_name        : (indirect string, offset: 0xa17): long long int
 <1><be3>: Abbrev Number: 2 (DW_TAG_base_type)
    <be4>   DW_AT_byte_size   : 16
    <be5>   DW_AT_encoding    : 4	(float)
    <be6>   DW_AT_name        : (indirect string, offset: 0xaac): long double
 <1><bea>: Abbrev Number: 2 (DW_TAG_base_type)
    <beb>   DW_AT_byte_size   : 1
    <bec>   DW_AT_encoding    : 2	(boolean)
    <bed>   DW_AT_name        : (indirect string, offset: 0xbaa): _Bool
 <1><bf1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bf2>   DW_AT_byte_size   : 8
    <bf3>   DW_AT_type        : <0xbf7>
 <1><bf7>: Abbrev Number: 18 (DW_TAG_const_type)
 <1><bf8>: Abbrev Number: 14 (DW_TAG_typedef)
    <bf9>   DW_AT_name        : (indirect string, offset: 0xa4e): cookie_read_function_t
    <bfd>   DW_AT_decl_file   : 8
    <bfe>   DW_AT_decl_line   : 441
    <c00>   DW_AT_decl_column : 22
    <c01>   DW_AT_type        : <0xc05>
 <1><c05>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c06>   DW_AT_prototyped  : 1
    <c06>   DW_AT_type        : <0xa5e>
    <c0a>   DW_AT_sibling     : <0xc1e>
 <2><c0e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c0f>   DW_AT_type        : <0xa82>
 <2><c13>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c14>   DW_AT_type        : <0xa84>
 <2><c18>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c19>   DW_AT_type        : <0xa52>
 <2><c1d>: Abbrev Number: 0
 <1><c1e>: Abbrev Number: 14 (DW_TAG_typedef)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x8ac): cookie_write_function_t
    <c23>   DW_AT_decl_file   : 8
    <c24>   DW_AT_decl_line   : 443
    <c26>   DW_AT_decl_column : 22
    <c27>   DW_AT_type        : <0xc2b>
 <1><c2b>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c2c>   DW_AT_prototyped  : 1
    <c2c>   DW_AT_type        : <0xa5e>
    <c30>   DW_AT_sibling     : <0xc44>
 <2><c34>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c35>   DW_AT_type        : <0xa82>
 <2><c39>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c3a>   DW_AT_type        : <0xab1>
 <2><c3e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c3f>   DW_AT_type        : <0xa52>
 <2><c43>: Abbrev Number: 0
 <1><c44>: Abbrev Number: 14 (DW_TAG_typedef)
    <c45>   DW_AT_name        : (indirect string, offset: 0xbcd): cookie_seek_function_t
    <c49>   DW_AT_decl_file   : 8
    <c4a>   DW_AT_decl_line   : 446
    <c4c>   DW_AT_decl_column : 20
    <c4d>   DW_AT_type        : <0xc51>
 <1><c51>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c52>   DW_AT_prototyped  : 1
    <c52>   DW_AT_type        : <0xa76>
    <c56>   DW_AT_sibling     : <0xc6a>
 <2><c5a>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c5b>   DW_AT_type        : <0xa82>
 <2><c5f>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c60>   DW_AT_type        : <0xc6a>
 <2><c64>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c65>   DW_AT_type        : <0x9ca>
 <2><c69>: Abbrev Number: 0
 <1><c6a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c6b>   DW_AT_byte_size   : 8
    <c6c>   DW_AT_type        : <0xa76>
 <1><c70>: Abbrev Number: 14 (DW_TAG_typedef)
    <c71>   DW_AT_name        : (indirect string, offset: 0x8d4): cookie_close_function_t
    <c75>   DW_AT_decl_file   : 8
    <c76>   DW_AT_decl_line   : 449
    <c78>   DW_AT_decl_column : 18
    <c79>   DW_AT_type        : <0xc7d>
 <1><c7d>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c7e>   DW_AT_prototyped  : 1
    <c7e>   DW_AT_type        : <0x9ca>
    <c82>   DW_AT_sibling     : <0xc8c>
 <2><c86>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <c87>   DW_AT_type        : <0xa82>
 <2><c8b>: Abbrev Number: 0
 <1><c8c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x9c0): cookie_io_functions_t
    <c91>   DW_AT_byte_size   : 32
    <c92>   DW_AT_decl_file   : 8
    <c93>   DW_AT_decl_line   : 451
    <c95>   DW_AT_decl_column : 16
    <c96>   DW_AT_sibling     : <0xcd3>
 <2><c9a>: Abbrev Number: 13 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0xa12): read
    <c9f>   DW_AT_decl_file   : 8
    <ca0>   DW_AT_decl_line   : 453
    <ca2>   DW_AT_decl_column : 31
    <ca3>   DW_AT_type        : <0xcd3>
    <ca7>   DW_AT_data_member_location: 0
 <2><ca8>: Abbrev Number: 13 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x858): write
    <cad>   DW_AT_decl_file   : 8
    <cae>   DW_AT_decl_line   : 454
    <cb0>   DW_AT_decl_column : 32
    <cb1>   DW_AT_type        : <0xcd9>
    <cb5>   DW_AT_data_member_location: 8
 <2><cb6>: Abbrev Number: 13 (DW_TAG_member)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x9ae): seek
    <cbb>   DW_AT_decl_file   : 8
    <cbc>   DW_AT_decl_line   : 455
    <cbe>   DW_AT_decl_column : 31
    <cbf>   DW_AT_type        : <0xcdf>
    <cc3>   DW_AT_data_member_location: 16
 <2><cc4>: Abbrev Number: 13 (DW_TAG_member)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x83b): close
    <cc9>   DW_AT_decl_file   : 8
    <cca>   DW_AT_decl_line   : 456
    <ccc>   DW_AT_decl_column : 32
    <ccd>   DW_AT_type        : <0xce5>
    <cd1>   DW_AT_data_member_location: 24
 <2><cd2>: Abbrev Number: 0
 <1><cd3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cd4>   DW_AT_byte_size   : 8
    <cd5>   DW_AT_type        : <0xbf8>
 <1><cd9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cda>   DW_AT_byte_size   : 8
    <cdb>   DW_AT_type        : <0xc1e>
 <1><cdf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ce0>   DW_AT_byte_size   : 8
    <ce1>   DW_AT_type        : <0xc44>
 <1><ce5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ce6>   DW_AT_byte_size   : 8
    <ce7>   DW_AT_type        : <0xc70>
 <1><ceb>: Abbrev Number: 14 (DW_TAG_typedef)
    <cec>   DW_AT_name        : (indirect string, offset: 0x9c0): cookie_io_functions_t
    <cf0>   DW_AT_decl_file   : 8
    <cf1>   DW_AT_decl_line   : 457
    <cf3>   DW_AT_decl_column : 3
    <cf4>   DW_AT_type        : <0xc8c>
 <1><cf8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cf9>   DW_AT_name        : (indirect string, offset: 0xa6d): file_struct
    <cfd>   DW_AT_byte_size   : 192
    <cfe>   DW_AT_decl_file   : 8
    <cff>   DW_AT_decl_line   : 526
    <d01>   DW_AT_decl_column : 8
    <d02>   DW_AT_sibling     : <0xdbd>
 <2><d06>: Abbrev Number: 13 (DW_TAG_member)
    <d07>   DW_AT_name        : (indirect string, offset: 0xbb0): fs_next
    <d0b>   DW_AT_decl_file   : 8
    <d0c>   DW_AT_decl_line   : 528
    <d0e>   DW_AT_decl_column : 27
    <d0f>   DW_AT_type        : <0xdbd>
    <d13>   DW_AT_data_member_location: 0
 <2><d14>: Abbrev Number: 13 (DW_TAG_member)
    <d15>   DW_AT_name        : (indirect string, offset: 0xc27): fs_lock
    <d19>   DW_AT_decl_file   : 8
    <d1a>   DW_AT_decl_line   : 529
    <d1c>   DW_AT_decl_column : 27
    <d1d>   DW_AT_type        : <0xbd0>
    <d21>   DW_AT_data_member_location: 8
 <2><d22>: Abbrev Number: 13 (DW_TAG_member)
    <d23>   DW_AT_name        : (indirect string, offset: 0xbc3): fs_iofunc
    <d27>   DW_AT_decl_file   : 8
    <d28>   DW_AT_decl_line   : 530
    <d2a>   DW_AT_decl_column : 27
    <d2b>   DW_AT_type        : <0xceb>
    <d2f>   DW_AT_data_member_location: 48
 <2><d30>: Abbrev Number: 13 (DW_TAG_member)
    <d31>   DW_AT_name        : (indirect string, offset: 0xbfe): fs_cookie
    <d35>   DW_AT_decl_file   : 8
    <d36>   DW_AT_decl_line   : 531
    <d38>   DW_AT_decl_column : 27
    <d39>   DW_AT_type        : <0xa82>
    <d3d>   DW_AT_data_member_location: 80
 <2><d3e>: Abbrev Number: 13 (DW_TAG_member)
    <d3f>   DW_AT_name        : (indirect string, offset: 0xc3a): fs_bufstart
    <d43>   DW_AT_decl_file   : 8
    <d44>   DW_AT_decl_line   : 533
    <d46>   DW_AT_decl_column : 27
    <d47>   DW_AT_type        : <0xa84>
    <d4b>   DW_AT_data_member_location: 88
 <2><d4c>: Abbrev Number: 13 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0xa97): fs_bufend
    <d51>   DW_AT_decl_file   : 8
    <d52>   DW_AT_decl_line   : 534
    <d54>   DW_AT_decl_column : 27
    <d55>   DW_AT_type        : <0xa84>
    <d59>   DW_AT_data_member_location: 96
 <2><d5a>: Abbrev Number: 13 (DW_TAG_member)
    <d5b>   DW_AT_name        : (indirect string, offset: 0x9f7): fs_bufpos
    <d5f>   DW_AT_decl_file   : 8
    <d60>   DW_AT_decl_line   : 535
    <d62>   DW_AT_decl_column : 27
    <d63>   DW_AT_type        : <0xa84>
    <d67>   DW_AT_data_member_location: 104
 <2><d68>: Abbrev Number: 13 (DW_TAG_member)
    <d69>   DW_AT_name        : (indirect string, offset: 0x9ec): fs_bufread
    <d6d>   DW_AT_decl_file   : 8
    <d6e>   DW_AT_decl_line   : 536
    <d70>   DW_AT_decl_column : 27
    <d71>   DW_AT_type        : <0xa84>
    <d75>   DW_AT_data_member_location: 112
 <2><d76>: Abbrev Number: 13 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0xbe4): fs_buffer
    <d7b>   DW_AT_decl_file   : 8
    <d7c>   DW_AT_decl_line   : 538
    <d7e>   DW_AT_decl_column : 27
    <d7f>   DW_AT_type        : <0xdc3>
    <d83>   DW_AT_data_member_location: 120
 <2><d84>: Abbrev Number: 13 (DW_TAG_member)
    <d85>   DW_AT_name        : (indirect string, offset: 0xb5b): fs_oflags
    <d89>   DW_AT_decl_file   : 8
    <d8a>   DW_AT_decl_line   : 541
    <d8c>   DW_AT_decl_column : 27
    <d8d>   DW_AT_type        : <0xa22>
    <d91>   DW_AT_data_member_location: 184
 <2><d92>: Abbrev Number: 13 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0xc76): fs_flags
    <d97>   DW_AT_decl_file   : 8
    <d98>   DW_AT_decl_line   : 542
    <d9a>   DW_AT_decl_column : 27
    <d9b>   DW_AT_type        : <0xa05>
    <d9f>   DW_AT_data_member_location: 186
 <2><da0>: Abbrev Number: 13 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0xc50): fs_nungotten
    <da5>   DW_AT_decl_file   : 8
    <da6>   DW_AT_decl_line   : 544
    <da8>   DW_AT_decl_column : 27
    <da9>   DW_AT_type        : <0xa05>
    <dad>   DW_AT_data_member_location: 187
 <2><dae>: Abbrev Number: 13 (DW_TAG_member)
    <daf>   DW_AT_name        : (indirect string, offset: 0x85e): fs_ungotten
    <db3>   DW_AT_decl_file   : 8
    <db4>   DW_AT_decl_line   : 545
    <db6>   DW_AT_decl_column : 27
    <db7>   DW_AT_type        : <0xdd3>
    <dbb>   DW_AT_data_member_location: 188
 <2><dbc>: Abbrev Number: 0
 <1><dbd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <dbe>   DW_AT_byte_size   : 8
    <dbf>   DW_AT_type        : <0xcf8>
 <1><dc3>: Abbrev Number: 21 (DW_TAG_array_type)
    <dc4>   DW_AT_type        : <0xa8a>
    <dc8>   DW_AT_sibling     : <0xdd3>
 <2><dcc>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <dcd>   DW_AT_type        : <0x9df>
    <dd1>   DW_AT_upper_bound : 63
 <2><dd2>: Abbrev Number: 0
 <1><dd3>: Abbrev Number: 21 (DW_TAG_array_type)
    <dd4>   DW_AT_type        : <0xa8a>
    <dd8>   DW_AT_sibling     : <0xde3>
 <2><ddc>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <ddd>   DW_AT_type        : <0x9df>
    <de1>   DW_AT_upper_bound : 1
 <2><de2>: Abbrev Number: 0
 <1><de3>: Abbrev Number: 3 (DW_TAG_typedef)
    <de4>   DW_AT_name        : (indirect string, offset: 0xa0d): FILE
    <de8>   DW_AT_decl_file   : 9
    <de9>   DW_AT_decl_line   : 112
    <dea>   DW_AT_decl_column : 28
    <deb>   DW_AT_type        : <0xcf8>
 <1><def>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <df0>   DW_AT_byte_size   : 8
    <df1>   DW_AT_type        : <0xde3>
 <1><df5>: Abbrev Number: 23 (DW_TAG_subprogram)
    <df6>   DW_AT_external    : 1
    <df6>   DW_AT_name        : (indirect string, offset: 0xa80): lib_fwrite
    <dfa>   DW_AT_decl_file   : 1
    <dfb>   DW_AT_decl_line   : 202
    <dfc>   DW_AT_decl_column : 9
    <dfd>   DW_AT_prototyped  : 1
    <dfd>   DW_AT_type        : <0xa5e>
    <e01>   DW_AT_low_pc      : 0x20a
    <e09>   DW_AT_high_pc     : 0x3e
    <e11>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e13>   DW_AT_GNU_all_call_sites: 1
    <e13>   DW_AT_sibling     : <0xea9>
 <2><e17>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <e18>   DW_AT_name        : ptr
    <e1c>   DW_AT_decl_file   : 1
    <e1d>   DW_AT_decl_line   : 202
    <e1e>   DW_AT_decl_column : 36
    <e1f>   DW_AT_type        : <0xbf1>
    <e23>   DW_AT_location    : 0x207 (location list)
 <2><e27>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e28>   DW_AT_name        : (indirect string, offset: 0xc0e): count
    <e2c>   DW_AT_decl_file   : 1
    <e2d>   DW_AT_decl_line   : 202
    <e2e>   DW_AT_decl_column : 48
    <e2f>   DW_AT_type        : <0xa52>
    <e33>   DW_AT_location    : 0x253 (location list)
 <2><e37>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e38>   DW_AT_name        : (indirect string, offset: 0xa79): stream
    <e3c>   DW_AT_decl_file   : 1
    <e3d>   DW_AT_decl_line   : 202
    <e3e>   DW_AT_decl_column : 65
    <e3f>   DW_AT_type        : <0xdef>
    <e43>   DW_AT_location    : 0x29e (location list)
 <2><e47>: Abbrev Number: 26 (DW_TAG_variable)
    <e48>   DW_AT_name        : ret
    <e4c>   DW_AT_decl_file   : 1
    <e4d>   DW_AT_decl_line   : 204
    <e4e>   DW_AT_decl_column : 11
    <e4f>   DW_AT_type        : <0xa5e>
    <e53>   DW_AT_location    : 0x2ea (location list)
 <2><e57>: Abbrev Number: 27 (DW_TAG_GNU_call_site)
    <e58>   DW_AT_low_pc      : 0x222
    <e60>   DW_AT_abstract_origin: <0x103e>
    <e64>   DW_AT_sibling     : <0xe6f>
 <3><e68>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <e69>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <e6b>   DW_AT_GNU_call_site_value: 2 byte block: 78 0 	(DW_OP_breg8 (s0): 0)
 <3><e6e>: Abbrev Number: 0
 <2><e6f>: Abbrev Number: 27 (DW_TAG_GNU_call_site)
    <e70>   DW_AT_low_pc      : 0x230
    <e78>   DW_AT_abstract_origin: <0xea9>
    <e7c>   DW_AT_sibling     : <0xe94>
 <3><e80>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <e81>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <e83>   DW_AT_GNU_call_site_value: 2 byte block: 79 0 	(DW_OP_breg9 (s1): 0)
 <3><e86>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <e87>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <e89>   DW_AT_GNU_call_site_value: 3 byte block: 91 58 6 	(DW_OP_fbreg: -40; DW_OP_deref)
 <3><e8d>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <e8e>   DW_AT_location    : 1 byte block: 5c 	(DW_OP_reg12 (a2))
    <e90>   DW_AT_GNU_call_site_value: 2 byte block: 78 0 	(DW_OP_breg8 (s0): 0)
 <3><e93>: Abbrev Number: 0
 <2><e94>: Abbrev Number: 29 (DW_TAG_GNU_call_site)
    <e95>   DW_AT_low_pc      : 0x23c
    <e9d>   DW_AT_abstract_origin: <0x104a>
 <3><ea1>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <ea2>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <ea4>   DW_AT_GNU_call_site_value: 2 byte block: 78 0 	(DW_OP_breg8 (s0): 0)
 <3><ea7>: Abbrev Number: 0
 <2><ea8>: Abbrev Number: 0
 <1><ea9>: Abbrev Number: 23 (DW_TAG_subprogram)
    <eaa>   DW_AT_external    : 1
    <eaa>   DW_AT_name        : (indirect string, offset: 0xb01): lib_fwrite_unlocked
    <eae>   DW_AT_decl_file   : 1
    <eaf>   DW_AT_decl_line   : 46
    <eb0>   DW_AT_decl_column : 9
    <eb1>   DW_AT_prototyped  : 1
    <eb1>   DW_AT_type        : <0xa5e>
    <eb5>   DW_AT_low_pc      : 0xe0
    <ebd>   DW_AT_high_pc     : 0x12a
    <ec5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ec7>   DW_AT_GNU_all_call_sites: 1
    <ec7>   DW_AT_sibling     : <0x103e>
 <2><ecb>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <ecc>   DW_AT_name        : ptr
    <ed0>   DW_AT_decl_file   : 1
    <ed1>   DW_AT_decl_line   : 46
    <ed2>   DW_AT_decl_column : 45
    <ed3>   DW_AT_type        : <0xbf1>
    <ed7>   DW_AT_location    : 0x320 (location list)
 <2><edb>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <edc>   DW_AT_name        : (indirect string, offset: 0xc0e): count
    <ee0>   DW_AT_decl_file   : 1
    <ee1>   DW_AT_decl_line   : 46
    <ee2>   DW_AT_decl_column : 57
    <ee3>   DW_AT_type        : <0xa52>
    <ee7>   DW_AT_location    : 0x41a (location list)
 <2><eeb>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <eec>   DW_AT_name        : (indirect string, offset: 0xa79): stream
    <ef0>   DW_AT_decl_file   : 1
    <ef1>   DW_AT_decl_line   : 47
    <ef2>   DW_AT_decl_column : 39
    <ef3>   DW_AT_type        : <0xdef>
    <ef7>   DW_AT_location    : 0x599 (location list)
 <2><efb>: Abbrev Number: 30 (DW_TAG_variable)
    <efc>   DW_AT_name        : (indirect string, offset: 0xb6b): start
    <f00>   DW_AT_decl_file   : 1
    <f01>   DW_AT_decl_line   : 50
    <f02>   DW_AT_decl_column : 19
    <f03>   DW_AT_type        : <0xab1>
    <f07>   DW_AT_location    : 0x5f8 (location list)
 <2><f0b>: Abbrev Number: 26 (DW_TAG_variable)
    <f0c>   DW_AT_name        : src
    <f10>   DW_AT_decl_file   : 1
    <f11>   DW_AT_decl_line   : 51
    <f12>   DW_AT_decl_column : 19
    <f13>   DW_AT_type        : <0xab1>
    <f17>   DW_AT_location    : 0x6f2 (location list)
 <2><f1b>: Abbrev Number: 26 (DW_TAG_variable)
    <f1c>   DW_AT_name        : ret
    <f20>   DW_AT_decl_file   : 1
    <f21>   DW_AT_decl_line   : 52
    <f22>   DW_AT_decl_column : 11
    <f23>   DW_AT_type        : <0xa5e>
    <f27>   DW_AT_location    : 0x84b (location list)
 <2><f2b>: Abbrev Number: 30 (DW_TAG_variable)
    <f2c>   DW_AT_name        : (indirect string, offset: 0xbf4): gulp_size
    <f30>   DW_AT_decl_file   : 1
    <f31>   DW_AT_decl_line   : 53
    <f32>   DW_AT_decl_column : 10
    <f33>   DW_AT_type        : <0xa52>
    <f37>   DW_AT_location    : 0x94d (location list)
 <2><f3b>: Abbrev Number: 31 (DW_TAG_label)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x834): errout
    <f40>   DW_AT_decl_file   : 1
    <f41>   DW_AT_decl_line   : 172
    <f42>   DW_AT_decl_column : 1
    <f43>   DW_AT_low_pc      : 0x1d8
 <2><f4b>: Abbrev Number: 32 (DW_TAG_lexical_block)
    <f4c>   DW_AT_low_pc      : 0x1ae
    <f54>   DW_AT_high_pc     : 0x14
    <f5c>   DW_AT_sibling     : <0xf85>
 <3><f60>: Abbrev Number: 30 (DW_TAG_variable)
    <f61>   DW_AT_name        : (indirect string, offset: 0xc7f): bytes_buffered
    <f65>   DW_AT_decl_file   : 1
    <f66>   DW_AT_decl_line   : 133
    <f67>   DW_AT_decl_column : 15
    <f68>   DW_AT_type        : <0x9ca>
    <f6c>   DW_AT_location    : 0x983 (location list)
 <3><f70>: Abbrev Number: 29 (DW_TAG_GNU_call_site)
    <f71>   DW_AT_low_pc      : 0x1b8
    <f79>   DW_AT_abstract_origin: <0x1056>
 <4><f7d>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <f7e>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <f80>   DW_AT_GNU_call_site_value: 2 byte block: 79 0 	(DW_OP_breg9 (s1): 0)
 <4><f83>: Abbrev Number: 0
 <3><f84>: Abbrev Number: 0
 <2><f85>: Abbrev Number: 33 (DW_TAG_GNU_call_site)
    <f86>   DW_AT_low_pc      : 0xf8
    <f8e>   DW_AT_abstract_origin: <0x1062>
 <2><f92>: Abbrev Number: 33 (DW_TAG_GNU_call_site)
    <f93>   DW_AT_low_pc      : 0x120
    <f9b>   DW_AT_abstract_origin: <0x1062>
 <2><f9f>: Abbrev Number: 34 (DW_TAG_GNU_call_site)
    <fa0>   DW_AT_low_pc      : 0x148
    <fa8>   DW_AT_sibling     : <0xfb9>
 <3><fac>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <fad>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <faf>   DW_AT_GNU_call_site_value: 2 byte block: 83 0 	(DW_OP_breg19 (s3): 0)
 <3><fb2>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <fb3>   DW_AT_location    : 1 byte block: 5c 	(DW_OP_reg12 (a2))
    <fb5>   DW_AT_GNU_call_site_value: 2 byte block: 82 0 	(DW_OP_breg18 (s2): 0)
 <3><fb8>: Abbrev Number: 0
 <2><fb9>: Abbrev Number: 33 (DW_TAG_GNU_call_site)
    <fba>   DW_AT_low_pc      : 0x158
    <fc2>   DW_AT_abstract_origin: <0x106f>
 <2><fc6>: Abbrev Number: 27 (DW_TAG_GNU_call_site)
    <fc7>   DW_AT_low_pc      : 0x164
    <fcf>   DW_AT_abstract_origin: <0x107c>
    <fd3>   DW_AT_sibling     : <0xfde>
 <3><fd7>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <fd8>   DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10 (a0))
    <fda>   DW_AT_GNU_call_site_value: 2 byte block: 79 0 	(DW_OP_breg9 (s1): 0)
 <3><fdd>: Abbrev Number: 0
 <2><fde>: Abbrev Number: 27 (DW_TAG_GNU_call_site)
    <fdf>   DW_AT_low_pc      : 0x190
    <fe7>   DW_AT_abstract_origin: <0x1088>
    <feb>   DW_AT_sibling     : <0xffc>
 <3><fef>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <ff0>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <ff2>   DW_AT_GNU_call_site_value: 2 byte block: 83 0 	(DW_OP_breg19 (s3): 0)
 <3><ff5>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <ff6>   DW_AT_location    : 1 byte block: 5c 	(DW_OP_reg12 (a2))
    <ff8>   DW_AT_GNU_call_site_value: 2 byte block: 78 0 	(DW_OP_breg8 (s0): 0)
 <3><ffb>: Abbrev Number: 0
 <2><ffc>: Abbrev Number: 34 (DW_TAG_GNU_call_site)
    <ffd>   DW_AT_low_pc      : 0x1ce
    <1005>   DW_AT_sibling     : <0x1016>
 <3><1009>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <100a>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <100c>   DW_AT_GNU_call_site_value: 2 byte block: 78 0 	(DW_OP_breg8 (s0): 0)
 <3><100f>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <1010>   DW_AT_location    : 1 byte block: 5c 	(DW_OP_reg12 (a2))
    <1012>   DW_AT_GNU_call_site_value: 2 byte block: 82 0 	(DW_OP_breg18 (s2): 0)
 <3><1015>: Abbrev Number: 0
 <2><1016>: Abbrev Number: 33 (DW_TAG_GNU_call_site)
    <1017>   DW_AT_low_pc      : 0x1e8
    <101f>   DW_AT_abstract_origin: <0x106f>
 <2><1023>: Abbrev Number: 29 (DW_TAG_GNU_call_site)
    <1024>   DW_AT_low_pc      : 0x1fc
    <102c>   DW_AT_abstract_origin: <0x1088>
 <3><1030>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <1031>   DW_AT_location    : 1 byte block: 5b 	(DW_OP_reg11 (a1))
    <1033>   DW_AT_GNU_call_site_value: 2 byte block: 78 0 	(DW_OP_breg8 (s0): 0)
 <3><1036>: Abbrev Number: 28 (DW_TAG_GNU_call_site_parameter)
    <1037>   DW_AT_location    : 1 byte block: 5c 	(DW_OP_reg12 (a2))
    <1039>   DW_AT_GNU_call_site_value: 2 byte block: 84 0 	(DW_OP_breg20 (s4): 0)
 <3><103c>: Abbrev Number: 0
 <2><103d>: Abbrev Number: 0
 <1><103e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <103f>   DW_AT_external    : 1
    <103f>   DW_AT_declaration : 1
    <103f>   DW_AT_linkage_name: (indirect string, offset: 0xac1): flockfile
    <1043>   DW_AT_name        : (indirect string, offset: 0xac1): flockfile
    <1047>   DW_AT_decl_file   : 9
    <1048>   DW_AT_decl_line   : 194
    <1049>   DW_AT_decl_column : 6
 <1><104a>: Abbrev Number: 35 (DW_TAG_subprogram)
    <104b>   DW_AT_external    : 1
    <104b>   DW_AT_declaration : 1
    <104b>   DW_AT_linkage_name: (indirect string, offset: 0xc6a): funlockfile
    <104f>   DW_AT_name        : (indirect string, offset: 0xc6a): funlockfile
    <1053>   DW_AT_decl_file   : 9
    <1054>   DW_AT_decl_line   : 196
    <1055>   DW_AT_decl_column : 6
 <1><1056>: Abbrev Number: 35 (DW_TAG_subprogram)
    <1057>   DW_AT_external    : 1
    <1057>   DW_AT_declaration : 1
    <1057>   DW_AT_linkage_name: (indirect string, offset: 0x888): lib_fflush_unlocked
    <105b>   DW_AT_name        : (indirect string, offset: 0x888): lib_fflush_unlocked
    <105f>   DW_AT_decl_file   : 10
    <1060>   DW_AT_decl_line   : 222
    <1061>   DW_AT_decl_column : 9
 <1><1062>: Abbrev Number: 36 (DW_TAG_subprogram)
    <1063>   DW_AT_external    : 1
    <1063>   DW_AT_declaration : 1
    <1063>   DW_AT_linkage_name: (indirect string, offset: 0xc8e): __errno
    <1067>   DW_AT_name        : (indirect string, offset: 0xc8e): __errno
    <106b>   DW_AT_decl_file   : 11
    <106c>   DW_AT_decl_line   : 364
    <106e>   DW_AT_decl_column : 10
 <1><106f>: Abbrev Number: 36 (DW_TAG_subprogram)
    <1070>   DW_AT_external    : 1
    <1070>   DW_AT_declaration : 1
    <1070>   DW_AT_linkage_name: (indirect string, offset: 0x858): write
    <1074>   DW_AT_name        : (indirect string, offset: 0x858): write
    <1078>   DW_AT_decl_file   : 12
    <1079>   DW_AT_decl_line   : 335
    <107b>   DW_AT_decl_column : 9
 <1><107c>: Abbrev Number: 35 (DW_TAG_subprogram)
    <107d>   DW_AT_external    : 1
    <107d>   DW_AT_declaration : 1
    <107d>   DW_AT_linkage_name: (indirect string, offset: 0x873): lib_rdflush_unlocked
    <1081>   DW_AT_name        : (indirect string, offset: 0x873): lib_rdflush_unlocked
    <1085>   DW_AT_decl_file   : 10
    <1086>   DW_AT_decl_line   : 226
    <1087>   DW_AT_decl_column : 5
 <1><1088>: Abbrev Number: 37 (DW_TAG_subprogram)
    <1089>   DW_AT_external    : 1
    <1089>   DW_AT_declaration : 1
    <1089>   DW_AT_linkage_name: (indirect string, offset: 0x8c4): memcpy
    <108d>   DW_AT_name        : (indirect string, offset: 0x841): __builtin_memcpy
    <1091>   DW_AT_decl_file   : 13
    <1092>   DW_AT_decl_line   : 0
 <1><1093>: Abbrev Number: 0
  Compilation Unit @ offset 0x1094:
   Length:        0x5bb (32-bit)
   Version:       4
   Abbrev Offset: 0x54e
   Pointer Size:  8
 <0><109f>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <10a0>   DW_AT_producer    : (indirect string, offset: 0xd3e): GNU C17 10.2.0 -mcmodel=medany -march=rv64imafdc -mabi=lp64d -march=rv64imafdc -g -Os -fno-common -fno-strict-aliasing -fomit-frame-pointer -ffunction-sections -fdata-sections
    <10a4>   DW_AT_language    : 12	(ANSI C99)
    <10a5>   DW_AT_name        : (indirect string, offset: 0xecc): stdio/lib_libfflush.c
    <10a9>   DW_AT_comp_dir    : (indirect string, offset: 0xe6b): /Users/Luppy/ox64/nuttx/libs/libc
    <10ad>   DW_AT_ranges      : 0xa0
    <10b1>   DW_AT_low_pc      : 0x0
    <10b9>   DW_AT_stmt_list   : 0x9e8
 <1><10bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <10be>   DW_AT_byte_size   : 1
    <10bf>   DW_AT_encoding    : 6	(signed char)
    <10c0>   DW_AT_name        : (indirect string, offset: 0xe47): signed char
 <1><10c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <10c5>   DW_AT_name        : (indirect string, offset: 0xcc6): _uint8_t
    <10c9>   DW_AT_decl_file   : 2
    <10ca>   DW_AT_decl_line   : 52
    <10cb>   DW_AT_decl_column : 28
    <10cc>   DW_AT_type        : <0x10d0>
 <1><10d0>: Abbrev Number: 2 (DW_TAG_base_type)
    <10d1>   DW_AT_byte_size   : 1
    <10d2>   DW_AT_encoding    : 8	(unsigned char)
    <10d3>   DW_AT_name        : (indirect string, offset: 0xf1a): unsigned char
 <1><10d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <10d8>   DW_AT_name        : (indirect string, offset: 0xf28): _int16_t
    <10dc>   DW_AT_decl_file   : 2
    <10dd>   DW_AT_decl_line   : 54
    <10de>   DW_AT_decl_column : 28
    <10df>   DW_AT_type        : <0x10e3>
 <1><10e3>: Abbrev Number: 2 (DW_TAG_base_type)
    <10e4>   DW_AT_byte_size   : 2
    <10e5>   DW_AT_encoding    : 5	(signed)
    <10e6>   DW_AT_name        : (indirect string, offset: 0xd34): short int
 <1><10ea>: Abbrev Number: 3 (DW_TAG_typedef)
    <10eb>   DW_AT_name        : (indirect string, offset: 0x105d): _uint16_t
    <10ef>   DW_AT_decl_file   : 2
    <10f0>   DW_AT_decl_line   : 55
    <10f1>   DW_AT_decl_column : 28
    <10f2>   DW_AT_type        : <0x10f6>
 <1><10f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <10f7>   DW_AT_byte_size   : 2
    <10f8>   DW_AT_encoding    : 7	(unsigned)
    <10f9>   DW_AT_name        : (indirect string, offset: 0xf90): short unsigned int
 <1><10fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <10fe>   DW_AT_name        : (indirect string, offset: 0xf07): _int32_t
    <1102>   DW_AT_decl_file   : 2
    <1103>   DW_AT_decl_line   : 58
    <1104>   DW_AT_decl_column : 28
    <1105>   DW_AT_type        : <0x1109>
 <1><1109>: Abbrev Number: 4 (DW_TAG_base_type)
    <110a>   DW_AT_byte_size   : 4
    <110b>   DW_AT_encoding    : 5	(signed)
    <110c>   DW_AT_name        : int
 <1><1110>: Abbrev Number: 2 (DW_TAG_base_type)
    <1111>   DW_AT_byte_size   : 4
    <1112>   DW_AT_encoding    : 7	(unsigned)
    <1113>   DW_AT_name        : (indirect string, offset: 0x1074): unsigned int
 <1><1117>: Abbrev Number: 2 (DW_TAG_base_type)
    <1118>   DW_AT_byte_size   : 8
    <1119>   DW_AT_encoding    : 5	(signed)
    <111a>   DW_AT_name        : (indirect string, offset: 0xfb0): long int
 <1><111e>: Abbrev Number: 2 (DW_TAG_base_type)
    <111f>   DW_AT_byte_size   : 8
    <1120>   DW_AT_encoding    : 7	(unsigned)
    <1121>   DW_AT_name        : (indirect string, offset: 0xf6e): long unsigned int
 <1><1125>: Abbrev Number: 3 (DW_TAG_typedef)
    <1126>   DW_AT_name        : (indirect string, offset: 0x10b2): _ssize_t
    <112a>   DW_AT_decl_file   : 2
    <112b>   DW_AT_decl_line   : 91
    <112c>   DW_AT_decl_column : 28
    <112d>   DW_AT_type        : <0x1117>
 <1><1131>: Abbrev Number: 3 (DW_TAG_typedef)
    <1132>   DW_AT_name        : (indirect string, offset: 0x1031): _size_t
    <1136>   DW_AT_decl_file   : 2
    <1137>   DW_AT_decl_line   : 93
    <1138>   DW_AT_decl_column : 28
    <1139>   DW_AT_type        : <0x111e>
 <1><113d>: Abbrev Number: 2 (DW_TAG_base_type)
    <113e>   DW_AT_byte_size   : 8
    <113f>   DW_AT_encoding    : 7	(unsigned)
    <1140>   DW_AT_name        : (indirect string, offset: 0xf49): long long unsigned int
 <1><1144>: Abbrev Number: 3 (DW_TAG_typedef)
    <1145>   DW_AT_name        : (indirect string, offset: 0xdfd): uint8_t
    <1149>   DW_AT_decl_file   : 3
    <114a>   DW_AT_decl_line   : 166
    <114b>   DW_AT_decl_column : 29
    <114c>   DW_AT_type        : <0x10c4>
 <1><1150>: Abbrev Number: 3 (DW_TAG_typedef)
    <1151>   DW_AT_name        : (indirect string, offset: 0xfc1): int16_t
    <1155>   DW_AT_decl_file   : 3
    <1156>   DW_AT_decl_line   : 168
    <1157>   DW_AT_decl_column : 29
    <1158>   DW_AT_type        : <0x10d7>
 <1><115c>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <115d>   DW_AT_type        : <0x1150>
 <1><1161>: Abbrev Number: 3 (DW_TAG_typedef)
    <1162>   DW_AT_name        : (indirect string, offset: 0xf65): uint16_t
    <1166>   DW_AT_decl_file   : 3
    <1167>   DW_AT_decl_line   : 169
    <1168>   DW_AT_decl_column : 29
    <1169>   DW_AT_type        : <0x10ea>
 <1><116d>: Abbrev Number: 3 (DW_TAG_typedef)
    <116e>   DW_AT_name        : (indirect string, offset: 0xfb9): int32_t
    <1172>   DW_AT_decl_file   : 3
    <1173>   DW_AT_decl_line   : 176
    <1174>   DW_AT_decl_column : 29
    <1175>   DW_AT_type        : <0x10fd>
 <1><1179>: Abbrev Number: 3 (DW_TAG_typedef)
    <117a>   DW_AT_name        : (indirect string, offset: 0xcea): intptr_t
    <117e>   DW_AT_decl_file   : 3
    <117f>   DW_AT_decl_line   : 238
    <1180>   DW_AT_decl_column : 29
    <1181>   DW_AT_type        : <0x1125>
 <1><1185>: Abbrev Number: 3 (DW_TAG_typedef)
    <1186>   DW_AT_name        : (indirect string, offset: 0xce3): size_t
    <118a>   DW_AT_decl_file   : 4
    <118b>   DW_AT_decl_line   : 133
    <118c>   DW_AT_decl_column : 22
    <118d>   DW_AT_type        : <0x1131>
 <1><1191>: Abbrev Number: 3 (DW_TAG_typedef)
    <1192>   DW_AT_name        : (indirect string, offset: 0xd2c): ssize_t
